-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： localhost:8889
-- 產生時間： 2023 年 07 月 21 日 03:52
-- 伺服器版本： 5.7.39
-- PHP 版本： 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `fridntrip_final`
--

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `product_id` int(11) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `product_price` decimal(10,2) NOT NULL,
  `product_brief` varchar(255) NOT NULL,
  `product_category` varchar(255) NOT NULL,
  `product_rate` float(2,1) NOT NULL DEFAULT '3.5',
  `product_launch` datetime NOT NULL,
  `product_discon` datetime NOT NULL,
  `product_main_img` varchar(255) NOT NULL,
  `product_description` text NOT NULL,
  `product_post` varchar(20) NOT NULL,
  `product_update` datetime NOT NULL,
  `product_upload` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`product_id`, `product_name`, `product_price`, `product_brief`, `product_category`, `product_rate`, `product_launch`, `product_discon`, `product_main_img`, `product_description`, `product_post`, `product_update`, `product_upload`) VALUES
(1, '冒險之旅鑰匙扣', '100.00', '跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙', '旅行 周邊 票券 送禮', 3.5, '2023-05-18 18:04:00', '2023-05-27 02:06:00', '0898e3d4d06df7bbdf204a18300dad29a6ee0cdc.jpg', '金央詞目澡黃像汁用幸冬加兆元久占丟「種」未雨飯幫示快和大母？歡停泉具房爪，收升了足回方沒婆鼻現！三不我乞後法這買雲很結正杯象。\r\n\r\n司福乾掃孝邊豆幼勿喝訴飽以語邊首候竹壯。抓裝讀八。手來弟亭種要教話爪實草音兄自由向。喝止陽士氣助故着叫主午升蛋唱占神？兆動因枝胡經常從還穿車因現意停哪次。言肖媽從戊壯不到。苦肉王急足哥更刀口九乙毛。', 'GCriJDJIa', '2023-05-19 10:13:58', '2023-05-19'),
(2, '友誼地圖杯墊', '125.00', '旅行放假牙的杯墊', '旅行 周邊 票券 送禮', 3.5, '2023-05-18 18:08:00', '2023-05-27 02:09:00', '042baa71089ba1ae4d11644d342574b0a2489317.jpg', '大杯墊', 'baidein', '2023-05-19 02:10:33', '2023-05-19'),
(3, '友誼手機殼', '1200.00', '賺你錢的手機殼', '旅行 周邊 票券 送禮', 3.5, '2023-05-18 18:14:00', '2023-05-20 02:14:00', '20d5a2298a9234d2a24700c4ba48f7367aa1747d.jpg', '超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼超強手機殼', 'coolphonecase', '2023-05-19 02:28:48', '2023-05-19'),
(4, '探索旅行筆記本', '99.00', '抄旅途美食小抄的筆記本', '旅行 周邊 票券 送禮', 3.5, '2023-05-19 18:19:00', '2023-06-22 02:20:00', '82b474e916504020166becccbd79a82b25aafeea.jpg', '筆記本超超超', 'bookGC', '2023-05-19 10:19:05', '2023-05-19'),
(5, '品牌旅行迷你相機', '10.00', '留下快樂回憶！', '品牌周邊', 3.5, '2023-05-20 18:22:00', '2023-05-29 02:22:00', '4df93468af44c5477c1cbd2ea5721fb4e03620c9.jpg', '超強皮超強配件付發票', 'GGrAADJIa', '2023-05-19 10:18:26', '2023-05-19'),
(6, '地圖手鍊', '99.00', '愛之手鍊', '品牌周邊', 3.5, '2023-05-18 18:24:00', '2023-05-27 02:24:00', '', '缺貨中，需等待100天才可出貨，柬埔寨進口手工地圖手鍊', 'chaiXsdf', '2023-05-19 02:25:32', '2023-05-19'),
(7, '山-溫泉大飯店早餐券', '2000.00', '陽明山五星級！', '超值票券', 3.5, '2023-05-18 18:25:00', '2023-05-27 02:26:00', '', 'XXX飯店，地址為台北市XX區XX路，用餐時段為中午12:00到下午18:00，不可轉贈', 'ticketdadsifj', '2023-05-19 10:12:13', '2023-05-19'),
(8, '健康補給飲料', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadfr', '2023-05-19 02:28:28', '2023-05-19'),
(9, '旅行小車車', '20.00', '老天保佑', '品牌周邊', 3.5, '2023-05-18 18:29:00', '2023-05-27 02:29:00', '8b3d94056dd3121de2d91eed00e416b2dfeec2fb.jpg', '保佑旅行愉快萬事如意身體健康保佑旅行愉快萬事如意身體健康保佑旅行愉快萬事如意身體健康保佑旅行愉快萬事如意身體健康保佑旅行愉快萬事如意身體健康保佑旅行愉快萬事如意身體健康保佑旅行愉快萬事如意身體健康保佑旅行愉快萬事如意身體健康保佑旅行愉快萬事如意身體健康保佑旅行愉快萬事如意身體健康保佑旅行愉快萬事如意身體健康', 'adfjviD', '2023-05-19 10:18:00', '2023-05-19'),
(10, '旅行瓶', '200.00', '旅行可裝水喝', '品牌周邊', 3.5, '2023-05-23 18:32:00', '2023-05-30 02:32:00', '1c65c4bba0240df4eb9bcce6e8f37a16dff7a862.jpg', '相機相機超超超', 'wateradfm', '2023-05-19 10:15:30', '2023-05-19'),
(11, '冒險耳機', '500.00', '和心儀的旅伴一起聽音樂！', '旅行', 3.5, '2023-05-18 18:33:00', '2023-05-23 02:34:00', 'e2af7467a57a9e1c32e074af0ffb5753854db80a.jpg', '黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全', 'unbasdfklm', '2023-05-19 10:14:55', '2023-05-19'),
(12, '旅行文具組', '210.00', '旅行文具組', '禮物', 3.5, '2023-05-18 18:35:00', '2023-06-14 02:35:00', '', '缺貨中！預計到貨日期不確定，請謹慎下標', 'asdlkfk', '2023-05-19 02:36:17', '2023-05-19'),
(13, '旅行免洗襪', '300.00', '竹炭纖維', '旅行', 3.5, '2023-05-18 18:36:00', '2023-05-25 02:36:00', '94beb87ffcf7b56f240e5130fd2f21795e384cba.jpg', '吵好穿', 'adsidkjc', '2023-05-19 02:37:19', '2023-05-19'),
(14, '123', '123.00', '123', '品牌周邊', 3.5, '2023-05-19 05:52:00', '2023-05-31 13:52:00', 'f355eb9e126954f0a6dfb79aceda271727274893.jpg', '123', 'lsjknfuiv', '2023-05-19 13:53:15', '2023-05-19'),
(15, '旅行免洗內褲', '300.00', '大內褲大內褲大內褲大內褲', '旅行', 3.5, '2023-05-18 18:36:00', '2023-05-25 02:36:00', '94beb87ffcf7b56f240e5130fd2f21795e384cba.jpg', '吵好穿', 'ggtttttttt', '2023-05-19 02:37:19', '2023-05-19'),
(16, '旅行免洗內褲', '300.00', '大內褲大內褲大內褲大內褲', '旅行', 3.5, '2023-05-18 18:36:00', '2023-05-25 02:36:00', '94beb87ffcf7b56f240e5130fd2f21795e384cba.jpg', '吵好穿', 'ggttttttttsadf', '2023-05-19 02:37:19', '2023-05-19'),
(17, '冒險耳機', '500.00', '和心儀的旅伴一起聽音樂！', '旅行', 3.5, '2023-05-18 18:33:00', '2023-05-23 02:34:00', 'e2af7467a57a9e1c32e074af0ffb5753854db80a.jpg', '黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全黃黃的走在馬路上比較安全', 'ddfadfbbbb', '2023-05-19 10:14:55', '2023-05-19'),
(18, '旅行瓶123', '200.00', '旅行可裝水喝', '品牌周邊', 3.5, '2023-05-23 18:32:00', '2023-05-30 02:32:00', '1c65c4bba0240df4eb9bcce6e8f37a16dff7a862.jpg', '相機相機超超超', 'wateradfm23', '2023-05-19 10:15:30', '2023-05-19'),
(19, '健康補給飲料33', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r', '2023-05-19 02:28:28', '2023-05-19'),
(20, '健康補給飲料34', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r4', '2023-05-19 02:28:28', '2023-05-19'),
(21, '健康補給飲料35', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r5', '2023-05-19 02:28:28', '2023-05-19'),
(22, '健康補給飲料36', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r6', '2023-05-19 02:28:28', '2023-05-19'),
(23, '健康補給飲料1', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf1', '2023-05-19 02:28:28', '2023-05-19'),
(24, '健康補給飲料2', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r2', '2023-05-19 02:28:28', '2023-05-19'),
(25, '健康補給飲料3', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r3', '2023-05-19 02:28:28', '2023-05-19'),
(26, '健康補給飲料4', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r4', '2023-05-19 02:28:28', '2023-05-19'),
(27, '健康補給飲料19', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf19', '2023-05-19 02:28:28', '2023-05-19'),
(28, '健康補給飲料29', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r29', '2023-05-19 02:28:28', '2023-05-19'),
(29, '健康補給飲料39', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r39', '2023-05-19 02:28:28', '2023-05-19'),
(30, '健康補給飲料18', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf18', '2023-05-19 02:28:28', '2023-05-19'),
(31, '健康補給飲料28', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r28', '2023-05-19 02:28:28', '2023-05-19'),
(32, '健康補給飲料38', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r38', '2023-05-19 02:28:28', '2023-05-19'),
(33, '健康補給飲料17', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', '7drinkdadf17', '2023-05-19 02:28:28', '2023-05-19'),
(34, '健康補給飲料27', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r27', '2023-05-19 02:28:28', '2023-05-19'),
(35, '健康補給飲料37', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r37', '2023-05-19 02:28:28', '2023-05-19'),
(36, '健康補給飲料16', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf16', '2023-05-19 02:28:28', '2023-05-19'),
(37, '健康補給飲料26', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r26', '2023-05-19 02:28:28', '2023-05-19'),
(38, '健康補給飲料36', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r36', '2023-05-19 02:28:28', '2023-05-19'),
(39, '健康補給飲料15', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf15', '2023-05-19 02:28:28', '2023-05-19'),
(40, '健康補給飲料25', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r25', '2023-05-19 02:28:28', '2023-05-19'),
(41, '健康補給飲料35', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r35', '2023-05-19 02:28:28', '2023-05-19'),
(42, '健康補給飲料155', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf155', '2023-05-19 02:28:28', '2023-05-19'),
(43, '健康補給飲料255', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r255', '2023-05-19 02:28:28', '2023-05-19'),
(44, '健康補給飲料355', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r355', '2023-05-19 02:28:28', '2023-05-19'),
(45, '健康補給飲料199', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', '999', '2023-05-19 02:28:28', '2023-05-19'),
(46, '健康補給飲料299', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r299', '2023-05-19 02:28:28', '2023-05-19'),
(47, '健康補給飲料399', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r399', '2023-05-19 02:28:28', '2023-05-19'),
(48, '健康補給飲料188', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf188', '2023-05-19 02:28:28', '2023-05-19'),
(49, '健康補給飲料288', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r288', '2023-05-19 02:28:28', '2023-05-19'),
(50, '健康補給飲料388', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r388', '2023-05-19 02:28:28', '2023-05-19'),
(51, '健康補給飲料177', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf177', '2023-05-19 02:28:28', '2023-05-19'),
(52, '健康補給飲料277', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r277', '2023-05-19 02:28:28', '2023-05-19'),
(53, '健康補給飲料377', '20.00', '旅行中補充體力', '外出小點', 3.5, '2023-05-18 18:27:00', '2023-05-27 02:28:00', '', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r377', '2023-05-19 02:28:28', '2023-05-19');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`product_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
