-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： localhost:8889
-- 產生時間： 2023 年 08 月 14 日 01:13
-- 伺服器版本： 5.7.39
-- PHP 版本： 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `fridntrip_final`
--

-- --------------------------------------------------------

--
-- 資料表結構 `datings`
--

CREATE TABLE `datings` (
  `member_id` int(10) NOT NULL,
  `i_gender` varchar(10) NOT NULL,
  `i_height_low` float DEFAULT NULL,
  `i_height_high` float DEFAULT NULL,
  `i_weight_low` float DEFAULT NULL,
  `i_weight_high` float DEFAULT NULL,
  `i_age_min` int(11) DEFAULT NULL,
  `i_age_max` int(11) DEFAULT NULL,
  `i_zodiac` varchar(255) DEFAULT NULL,
  `i_bloodtype` varchar(255) DEFAULT NULL,
  `i_alchohol` varchar(255) DEFAULT NULL,
  `i_smoke` varchar(255) DEFAULT NULL,
  `i_education_level` varchar(255) DEFAULT NULL,
  `i_job` varchar(255) DEFAULT NULL,
  `i_hobby` varchar(255) DEFAULT NULL,
  `i_character` varchar(255) DEFAULT NULL,
  `create_at` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `datings`
--

INSERT INTO `datings` (`member_id`, `i_gender`, `i_height_low`, `i_height_high`, `i_weight_low`, `i_weight_high`, `i_age_min`, `i_age_max`, `i_zodiac`, `i_bloodtype`, `i_alchohol`, `i_smoke`, `i_education_level`, `i_job`, `i_hobby`, `i_character`, `create_at`) VALUES
(1, '女', 133, 167, 44, 105, 20, 26, '射手座', 'A', '有', '小酌', '高中', '不相關', '不一樣', '外向', '2023-05-25'),
(2, '男', 166, 186, 61, 77, 23, 72, '雙魚座', 'B', '無', '滴酒不沾', '高中', '相關', '不一樣', '外向', '2023-05-25'),
(3, '女', 137, 159, 67, 85, 50, 82, '獅子座', 'A', '有', '滴酒不沾', '高中', '不相關', '不一樣', '內向', '2023-05-25'),
(4, '女', 134, 163, 33, 62, 18, 32, '巨蟹座', 'AB', '有', '滴酒不沾', '學士', '相關', '不一樣', '外向', '2023-05-25'),
(5, '男', 150, 174, 50, 71, 24, 32, '金牛座', 'A', '無', '酒豪', '高中', '不相關', '不一樣', '內向', '2023-05-25'),
(6, '都可以', 165, 193, 58, 95, 23, 38, '金牛座', 'A', '無', '滴酒不沾', '國小', '相關', '不一樣', '外向', '2023-05-25'),
(7, '女', 131, 152, 53, 75, 25, 64, '雙魚座', 'AB', '有', '小酌', '學士', '不相關', '一樣', '內向', '2023-05-25'),
(8, '男', 161, 182, 47, 73, 25, 33, '雙子座', 'B', '無', '小酌', '國中', '不相關', '不一樣', '內向', '2023-05-25'),
(9, '女', 135, 156, 65, 82, 20, 88, '獅子座', 'AB', '有', '酒豪', '國中', '相關', '不一樣', '外向', '2023-05-25'),
(10, '都可以', 180, 188, 63, 72, 22, 97, '牡羊座', 'O', '有', '酒豪', '學士', '不相關', '不一樣', '外向', '2023-05-25'),
(11, '都可以', 174, 196, 60, 110, 18, 50, '處女座', 'O', '無', '小酌', '高中', '相關', '一樣', '外向', '2023-05-25'),
(12, '男', 164, 165, 49, 97, 22, 70, '天秤座', 'AB', '有', '小酌', '高中', '相關', '不一樣', '外向', '2023-05-25'),
(13, '男', 152, 182, 67, 91, 24, 99, '金牛座', 'A', '無', '滴酒不沾', '博士', '相關', '一樣', '外向', '2023-05-25'),
(14, '男', 154, 164, 59, 74, 24, 45, '水瓶座', 'A', '有', '酒豪', '國中', '相關', '不一樣', '外向', '2023-05-25'),
(15, '都可以', 163, 193, 41, 70, 18, 41, '雙子座', 'O', '無', '小酌', '碩士', '相關', '一樣', '內向', '2023-05-25'),
(16, '女', 131, 159, 62, 71, 27, 41, '天蠍座', 'AB', '無', '酒豪', '學士', '不相關', '不一樣', '內向', '2023-05-25'),
(17, '男', 168, 176, 52, 92, 23, 51, '水瓶座', 'AB', '有', '滴酒不沾', '學士', '相關', '不一樣', '外向', '2023-05-25'),
(18, '女', 140, 156, 40, 93, 28, 32, '處女座', 'B', '有', '酒豪', '博士', '不相關', '不一樣', '外向', '2023-05-25'),
(19, '都可以', 152, 181, 47, 89, 18, 50, '金牛座', 'O', '無', '滴酒不沾', '高中', '不相關', '一樣', '內向', '2023-05-25'),
(20, '男', 165, 175, 56, 75, 25, 52, '水瓶座', 'A', '有', '滴酒不沾', '國中', '相關', '一樣', '外向', '2023-05-25'),
(21, '女', 134, 156, 66, 91, 28, 83, '雙魚座', 'A', '無', '酒豪', '碩士', '相關', '一樣', '內向', '2023-05-25'),
(22, '男', 168, 169, 53, 96, 21, 85, '金牛座', 'AB', '有', '小酌', '博士', '不相關', '一樣', '外向', '2023-05-25'),
(23, '男', 150, 180, 45, 90, 29, 75, '雙魚座', 'O', '有', '滴酒不沾', '國小', '相關', '一樣', '內向', '2023-05-25'),
(24, '男', 162, 172, 48, 96, 25, 91, '水瓶座', 'A', '無', '酒豪', '博士', '不相關', '不一樣', '外向', '2023-05-25'),
(25, '男', 160, 184, 65, 73, 23, 58, '雙魚座', 'B', '有', '小酌', '高中', '相關', '一樣', '外向', '2023-05-25'),
(26, '男', 163, 184, 55, 79, 21, 57, '獅子座', 'B', '有', '酒豪', '學士', '相關', '不一樣', '外向', '2023-05-25'),
(27, '男', 150, 177, 46, 86, 19, 84, '天秤座', 'B', '有', '滴酒不沾', '高中', '相關', '不一樣', '內向', '2023-05-25'),
(28, '男', 167, 175, 54, 92, 28, 76, '天蠍座', 'O', '無', '滴酒不沾', '碩士', '不相關', '一樣', '外向', '2023-05-25'),
(29, '女', 132, 160, 60, 76, 25, 30, '巨蟹座', 'B', '有', '小酌', '學士', '不相關', '不一樣', '外向', '2023-05-25'),
(30, '男', 161, 184, 54, 103, 23, 32, '巨蟹座', 'AB', '無', '滴酒不沾', '學士', '不相關', '一樣', '外向', '2023-05-25'),
(31, '女', 130, 163, 56, 74, 25, 41, '水瓶座', 'A', '無', '酒豪', '學士', '相關', '一樣', '內向', '2023-05-25'),
(32, '都可以', 159, 200, 55, 104, 25, 79, '射手座', 'AB', '無', '滴酒不沾', '高中', '不相關', '一樣', '外向', '2023-05-25'),
(33, '女', 135, 150, 49, 90, 19, 31, '巨蟹座', 'A', '無', '小酌', '國中', '相關', '一樣', '外向', '2023-05-25'),
(34, '都可以', 159, 191, 49, 102, 30, 30, '魔羯座', 'A', '有', '酒豪', '博士', '相關', '一樣', '外向', '2023-05-25'),
(35, '男', 155, 175, 69, 103, 24, 100, '獅子座', 'AB', '有', '滴酒不沾', '國中', '相關', '一樣', '外向', '2023-05-25'),
(36, '男', 160, 162, 69, 96, 24, 95, '天秤座', 'B', '有', '小酌', '博士', '不相關', '一樣', '外向', '2023-05-25'),
(37, '男', 166, 188, 63, 71, 19, 74, '牡羊座', 'B', '無', '小酌', '學士', '相關', '不一樣', '外向', '2023-05-25'),
(38, '女', 132, 166, 53, 104, 29, 58, '雙魚座', 'O', '無', '酒豪', '碩士', '不相關', '不一樣', '外向', '2023-05-25'),
(39, '都可以', 164, 188, 66, 93, 21, 35, '雙子座', 'AB', '無', '小酌', '高中', '不相關', '不一樣', '外向', '2023-05-25'),
(40, '女', 136, 158, 57, 99, 23, 45, '魔羯座', 'A', '無', '小酌', '國中', '不相關', '不一樣', '外向', '2023-05-25'),
(41, '男', 165, 168, 53, 94, 25, 91, '雙魚座', 'A', '無', '酒豪', '博士', '不相關', '不一樣', '內向', '2023-05-25'),
(42, '女', 131, 158, 44, 83, 25, 77, '天秤座', 'B', '有', '小酌', '高中', '不相關', '不一樣', '內向', '2023-05-25'),
(43, '男', 156, 182, 60, 87, 21, 84, '射手座', 'A', '無', '酒豪', '博士', '相關', '一樣', '外向', '2023-05-25'),
(44, '女', 132, 167, 49, 83, 23, 88, '處女座', 'AB', '無', '酒豪', '國中', '不相關', '一樣', '內向', '2023-05-25'),
(45, '都可以', 154, 192, 58, 97, 24, 86, '水瓶座', 'AB', '有', '酒豪', '國中', '相關', '一樣', '外向', '2023-05-25'),
(46, '都可以', 171, 200, 60, 72, 18, 66, '魔羯座', 'AB', '無', '滴酒不沾', '學士', '不相關', '不一樣', '外向', '2023-05-25'),
(47, '男', 157, 184, 62, 76, 26, 41, '射手座', 'B', '無', '小酌', '高中', '不相關', '不一樣', '外向', '2023-05-25'),
(48, '男', 165, 181, 51, 104, 21, 48, '天秤座', 'O', '無', '滴酒不沾', '國小', '相關', '一樣', '內向', '2023-05-25'),
(49, '都可以', 156, 183, 60, 84, 21, 87, '射手座', 'O', '有', '酒豪', '學士', '相關', '一樣', '內向', '2023-05-25'),
(50, '都可以', 173, 180, 55, 75, 25, 50, '牡羊座', 'A', '有', '小酌', '國小', '不相關', '不一樣', '外向', '2023-05-25');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `datings`
--
ALTER TABLE `datings`
  ADD PRIMARY KEY (`member_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `datings`
--
ALTER TABLE `datings`
  MODIFY `member_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1001;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
