-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： localhost:8889
-- 產生時間： 2023 年 08 月 10 日 08:02
-- 伺服器版本： 5.7.39
-- PHP 版本： 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `fridntrip_final`
--

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `product_id` int(11) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `product_price` decimal(10,2) NOT NULL,
  `product_brief` varchar(255) NOT NULL,
  `product_category` varchar(255) NOT NULL,
  `product_rate` int(5) NOT NULL DEFAULT '4',
  `product_launch` datetime NOT NULL,
  `product_discon` datetime NOT NULL,
  `product_main_img` varchar(255) NOT NULL,
  `product_description` text NOT NULL,
  `product_post` varchar(20) NOT NULL,
  `product_update` datetime NOT NULL,
  `product_upload` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`product_id`, `product_name`, `product_price`, `product_brief`, `product_category`, `product_rate`, `product_launch`, `product_discon`, `product_main_img`, `product_description`, `product_post`, `product_update`, `product_upload`) VALUES
(1, '冒險之旅鑰匙扣', '100.00', '一個組合的精緻鑰匙扣，有雷射雕刻紀念價值的文字一個組合包，可以分送給旅行親友，為本網站設計之精緻之作', '周邊 旅行 禮品', 3, '2023-05-18 18:04:00', '2023-05-27 02:06:00', 'p-i1.png', '一個組合的精緻鑰匙扣，由手工訂製，好握可扣在旅行包包上增加紀念價值，有雷射雕刻客製化的文字，可用於送禮、旅行時，為 FriendTrip 特別訂製款，超好用有別於市面上其他的產品。', 'GCriJDJIa', '2023-05-19 10:13:58', '2023-05-19'),
(2, '友誼地圖杯墊', '125.00', '地圖的杯墊，紀錄你的旅行', '周邊 禮品', 4, '2023-05-18 18:08:00', '2023-05-27 02:09:00', 'p-i2.png', '這款精緻杯墊以其簡約而優雅的設計脫穎而出。採用高品質材料製作，不僅能有效保護桌面，還能為您的飲品贈予舒適的基底，為日常生活增添一絲品味與風格。無論是家中、辦公室還是咖啡廳，都是理想的選擇。', 'baidein', '2023-05-19 02:10:33', '2023-05-19'),
(3, '友誼手機殼', '1200.00', 'FriendTrip 客製手機殼，保護您的手機', '周邊 禮品', 5, '2023-05-18 18:14:00', '2023-05-20 02:14:00', 'p-i3.png', '這款精緻手機殼結合時尚與保護功能，精心設計並使用優質材料製成。其創意設計不僅提供優越的保護，還能為您的手機增添個性和風格，完美展現您的品味。無論是外出還是日常使用，都是不可或缺的時尚配件。', 'coolphonecase', '2023-05-19 02:28:48', '2023-05-19'),
(4, '探索旅行筆記本', '99.00', '方便攜帶的旅行筆記本，記錄旅程和靈感', '周邊 旅行', 4, '2023-05-19 18:19:00', '2023-06-22 02:20:00', 'p-i4.png', '這款旅行用筆記本是旅行者的理想選擇。它小巧輕便，易於攜帶，讓您隨時隨地記錄旅途的美景、體驗和感想。精心設計的硬皮封面確保耐用性，內頁可以是空白、方格或行線，適應不同書寫需求。書中的口袋可存放小物件，如車票、紀念品。無論是寫遊記、畫素描，還是記下靈感，這本筆記本都是您旅行中的忠實夥伴。', 'bookGC', '2023-05-19 10:19:05', '2023-05-19'),
(5, '品牌旅行迷你相機', '22000.00', '迷你相機，輕巧便攜，捕捉精彩瞬間', '周邊 旅行', 4, '2023-05-20 18:22:00', '2023-05-29 02:22:00', 'p-i5.png', '這款旅行用迷你相機尺寸小巧，便於隨身攜帶。優質鏡頭和高解析度感測器確保捕捉清晰生動的照片和影片。多種拍攝模式，如風景、人像和夜景，能應對不同場景。內建連接功能可即時分享旅程，而耐用外殼則能承受旅途中的挑戰。無論您探索自然風光或城市街道，這款迷你相機都能紀錄您的珍貴瞬間。', 'GGrAADJIa', '2023-05-19 10:18:26', '2023-05-19'),
(6, '地圖手鍊', '99.00', '象徵愛情和羈絆之愛之手鍊，送禮的完美選擇', '禮品', 4, '2023-05-18 18:24:00', '2023-05-27 02:24:00', 'p-i6.png', '這款愛之鎖鍊是獨特的送禮選擇。鍊上掛著一個精緻的鎖型吊墜，寓意著愛情的牢固和羈絆的深厚。鍊子採用高品質材料打造，閃亮的鏈環與吊墜展現時尚感。適合情侶、親友或特別的人，是傳遞情感和祝福的美好禮物。不僅能點綴造型，更能永久鎖住珍貴的回憶與情感。', 'chaiXsdf', '2023-05-19 02:25:32', '2023-05-19'),
(7, '陽明山溫泉大飯店邀請卡', '2000.00', '陽明山五星級酒店讓您體驗豐盛美味的早晨', '旅行 票券', 4, '2023-05-18 18:25:00', '2023-05-27 02:26:00', 'p-i7.png', '這張陽明山溫泉飯店早餐券帶您進入一個美味的早晨世界。餐券包括多道豐盛早餐，從新鮮水果、烘焙點心到各式美味料理，滿足您的味蕾。飯店典雅的用餐環境與親切的服務，讓您在享受美食的同時，也能感受到獨特的休閒氛圍。無論是悠閒假日或商務出差，這張券都是您愜意旅程的完美開始。', 'ticketdadsifj', '2023-05-19 10:12:13', '2023-05-19'),
(8, '旅行保溫瓶', '670.00', '時尚簡約的保溫瓶，讓您旅行中不會口渴！', '旅行 禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i8.png', '這款旅行用精緻保溫瓶設計精巧，適合隨身攜帶。採用優質不鏽鋼材料，保溫效果卓越，可保持飲品熱或冷多個小時。瓶蓋設計防漏，確保不會有意外的滲漏。輕盈的外觀與人體工學設計，方便攜帶並且易於使用。不論旅行、戶外活動或日常使用，都能保持您的飲品在最佳溫度。', 'drinkdadfr', '2023-05-19 02:28:28', '2023-05-19'),
(9, '旅行托特包', '980.00', '輕便易攜，滿足旅途所需', '旅行 禮品', 4, '2023-05-18 18:29:00', '2023-05-27 02:29:00', 'p-i9.png', '這款旅行托特包是您旅程的理想伴侶。輕巧的設計使其方便攜帶，充足的容量能容納旅途所需物品，如雜誌、水瓶、電子設備等。耐用的材料確保長久使用，設有多個內外袋可整理物品。無論您前往海灘、城市探險或逛街，這個托特包都能輕鬆應對各種情境。', 'adfjviD', '2023-05-19 10:18:00', '2023-05-19'),
(10, '時尚旅行水瓶', '200.00', '輕盈便攜，展現個人風格之水瓶', '周邊 旅行 禮品', 4, '2023-05-23 18:32:00', '2023-05-30 02:32:00', 'p-i10.png', '這款時尚塑膠水瓶不僅實用，還具有設計感。輕巧的外觀方便隨身攜帶，適用於辦公、運動或旅行。環保材料製作，安全無毒。特別的設計與圖案讓您在飲水時也能展現個人風格。融合時尚和功能性，這個水瓶是健康生活的完美伴侶。', 'wateradfm', '2023-05-19 10:15:30', '2023-05-19'),
(11, '冒險耳機', '500.00', '耐用防水，為冒險者帶來音樂與樂趣', '周邊 禮品', 4, '2023-05-18 18:33:00', '2023-05-23 02:34:00', 'p-i11.png', '這款冒險耳機是您在戶外探險時的最佳選擇。耳機具有耐用的防水和防汗功能，適應各種惡劣環境。無線連接技術讓您在移動中也能輕鬆享受高品質音樂。舒適的設計和適應性耳塞確保長時間佩戴的舒適感。無論您是遠足、騎行還是滑雪，這個耳機都是您的冒險夥伴，讓音樂伴您探索未知。', 'unbasdfklm', '2023-05-19 10:14:55', '2023-05-19'),
(12, '旅行文具組', '210.00', '方便攜帶，讓您隨時記錄創作', '旅行 禮品', 4, '2023-05-18 18:35:00', '2023-06-14 02:35:00', 'p-i12.png', '這款旅行文具組是旅途中的必備工具。包含筆、筆記本、貼紙、修正帶等，能讓您輕鬆記錄旅行見聞、做手工藝品或寫下靈感。精巧的設計和便攜性，使其適合放在背包或手提包中。在旅程中，您可以隨時使用這個文具組，保持創意流動，紀錄珍貴瞬間。', 'asdlkfk', '2023-05-19 02:36:17', '2023-05-19'),
(13, '旅行羊毛襪', '300.00', '旅行羊毛襪，舒適保暖，適合冒險旅程', '旅行 禮品', 4, '2023-05-18 18:36:00', '2023-05-25 02:36:00', 'p-i13.png', '這款旅行羊毛襪是您冒險旅程的理想伴侶。以高品質羊毛製成，提供極佳的保暖效果，同時具備透氣性和吸濕能力，讓您的腳部保持舒適乾爽。耐久的設計確保長時間使用，適合長途步行、徒步旅行或冬季探險。在不同氣候下，這款羊毛襪都能為您的腳部提供最佳保護和舒適感。', 'adsidkjc', '2023-05-19 02:37:19', '2023-05-19'),
(14, '圖片短袖上衣', '545.00', '時尚舒適，展現旅行風格', '周邊 禮品', 4, '2023-05-19 05:52:00', '2023-05-31 13:52:00', 'p-i14.png', '這款旅行品牌T恤融合時尚與舒適。使用優質面料，柔軟透氣。獨特的設計展現旅行元素，如地圖、標誌等，讓您在穿著中流露熱愛旅行的個性。適合城市漫遊、探險旅程，亦是展現自我獨特風格的選擇。無論何地，這件T恤都是您舒適時尚的夥伴。', 'lsjknfuiv', '2023-05-19 13:53:15', '2023-05-19'),
(15, '素面旅行上衣', '300.00', '素面簡約，展現個人之風格', '旅行', 4, '2023-05-18 18:36:00', '2023-05-25 02:36:00', 'p-i15.png', '這款素面T恤融合時尚與舒適。使用優質面料，柔軟透氣。獨特的設計展現特別版行，讓您在穿著中流露熱愛旅行的個性。適合城市漫遊、探險旅程，亦是展現自我獨特風格的選擇。無論何地，這件T恤都是您舒適時尚的夥伴。', 'ggtttttttt', '2023-05-19 02:37:19', '2023-05-19'),
(16, '送禮包裝', '300.00', '精美送禮包裝，增添禮物價值', '禮品', 4, '2023-05-18 18:36:00', '2023-05-25 02:36:00', 'p-i16.png', '這款精緻送禮包裝為您的禮物增添特別價值。精心選擇的包裝材料、設計，展現出對接收者的用心關懷。包裝內外皆可選用簡約或華麗風格，以適應不同場合和喜好。透過精美包裝，您的禮物將更顯珍貴，也能更深刻地傳達您的情感和祝福。', 'ggttttttttsadf', '2023-05-19 02:37:19', '2023-05-19'),
(17, '送禮禮物盒', '500.00', '精緻禮物盒子，裝點心意', '禮品', 4, '2023-05-18 18:33:00', '2023-05-23 02:34:00', 'p-i17.png', '這款禮物盒子展現您的心意。精心製作的外觀設計，以及質感優良的包裝材料，為您的禮物增添獨特風采。盒內可放置禮品、小物件或飾品，為受贈者帶來驚喜和喜悅。無論是節日、生日或特殊場合，這個禮物盒子都能為您的心意注入更多溫暖和特殊意義。\r\n\r\n\r\n\r\n\r\n\r\n', 'ddfadfbbbb', '2023-05-19 10:14:55', '2023-05-19'),
(18, '包裝棉線', '15.00', '禮物盒子包裝棉線，環保簡約，適合裝飾與保護', '周邊', 4, '2023-05-23 18:32:00', '2023-05-30 02:32:00', 'p-i18.png', '這款禮物盒子包裝棉線是環保且多功能的選擇。用柔軟的棉線巧妙地裝飾禮物盒，增添自然風格。同時，它可防止禮物在運送中損壞，保護禮物的完整性。這種簡約而美觀的包裝方式，為您的禮物添加一份特別的觸感，讓受贈者感受到您的用心和溫暖。', 'wateradfm23', '2023-05-19 10:15:30', '2023-05-19'),
(19, '福隆海洋音樂祭優惠券', '2000.00', '福隆海洋音樂祭即將在10/09登場！', '票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i19.png', '福隆海洋音樂祭即將在10/09登場！憑此優惠券可以兌換免費飲料和住宿！租車有9折優惠！超級超值的組合需要您立即擁有！主辦單位保留最後的解釋權，詳細請洽福隆海洋音樂祭主辦單位官方網站。', 'drinkdadf33r', '2023-05-19 02:28:28', '2023-05-19'),
(20, '玉山登山旅行套票', '5000.00', '專業嚮導帶領您探索深山之美，免費專車接送', '票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i20.png', '這些在地旅行優惠券提供各種折扣和優惠，包括景點門票、餐廳、住宿和交通。您可以在各種旅遊網站、應用程式或商家獲取。這些優惠券讓您在探索台灣的同時，享受更優惠的價格和更多活動選擇，為您的旅行增添更多樂趣。', 'drinkdadf33r4', '2023-05-19 02:28:28', '2023-05-19'),
(21, '星巴克會員專屬優惠券', '50.00', '旅行中補充體力，可免費兌換大冰美', '周邊 禮品 票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i21.png', '星巴克聯名 FriendTrip 優惠券！享受當下就來一杯大冰美！', 'drinkdadf33r5', '2023-05-19 02:28:28', '2023-05-19'),
(22, '六角餐廳沙拉兌換券', '20.00', '台北知名餐廳六角可兌換商品', '票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i22.png', '台北知名餐廳六角可兌換商品，免費凱薩沙拉！可以和朋友一起去六角一起享受美食和超好吃沙拉！保證吃超飽健康又營養。', 'drinkdadf33r6', '2023-05-19 02:28:28', '2023-05-19'),
(23, '高雄音樂祭優惠套票', '1000.00', '在高雄舉辦的在地音樂節', '票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i23.png', '在高雄舉辦的在地音樂節，擁有超優惠套票！登場的有樂手和超級天團，保證不失望！可免費兌換超級飲料和美食，停車免費！', 'drinkdadf1', '2023-05-19 02:28:28', '2023-05-19'),
(24, '全台停車優惠', '50.00', '和全台100家停車業者結合', '旅行 票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i24.png', '和全台100家停車業者結合，可停車六小時，和全台100家停車業者結合，可停車六小時，和全台100家停車業者結合，可停車六小時，和全台100家停車業者結合，可停車六小時。', 'drinkdadf33r2', '2023-05-19 02:28:28', '2023-05-19'),
(25, '大遠百購物禮券', '1000.00', '購物滿10000元即可使用！', '票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i25.png', '購物滿10000元即可使用！購物滿10000元即可使用！購物滿10000元即可使用！購物滿10000元即可使用！購物滿10000元即可使用！購物滿10000元即可使用！購物滿10000元即可使用！購物滿10000元即可使用！購物滿10000元即可使用！', 'drinkdadf33r3', '2023-05-19 02:28:28', '2023-05-19'),
(26, '澎湖旅遊振興券', '1000.00', '一起去澎湖旅遊吧，有附贈超划算機票和民宿，一起吃超級大海鮮', '旅行 票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i26.png', '一起去澎湖旅遊吧，有附贈超划算機票和民宿，一起吃超級大海鮮，海鮮有鯨魚、安康魚、吳郭魚、福壽螺。還有華航頂級商務艙乘坐，旅館位於馬公市。', 'drinkdadf33r4', '2023-05-19 02:28:28', '2023-05-19'),
(27, '公館河岸留言優惠券', '300.00', '憑票券可換免費大豬排', '票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i27.png', '公館河岸留言優惠券，這些在地旅行優惠券提供各種折扣和優惠，包括景點門票、餐廳、住宿和交通。您可以在各種旅遊網站、應用程式或商家獲取。這些優惠券讓您在探索台灣的同時，享受更優惠的價格和更多活動選擇，為您的旅行增添更多樂趣。', 'drinkdadf19', '2023-05-19 02:28:28', '2023-05-19'),
(28, '紀念明信片-黑白', '11.00', '旅行中紀念明信片，簡約時尚', '禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i28.png', '旅行中紀念明信片，簡約時尚旅行中紀念明信片，這些在地旅行優惠券提供各種折扣和優惠，包括景點門票、餐廳、住宿和交通。您可以在各種旅遊網站、應用程式或商家獲取。這些優惠券讓您在探索台灣的同時，享受更優惠的價格和更多活動選擇，為您的旅行增添更多樂趣。', 'drinkdadf33r29', '2023-05-19 02:28:28', '2023-05-19'),
(29, '紀念明信片-手寫', '19.00', '草寫好看的名信片', '禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i29.png', '草寫好看的名信片，很好看，這些在地旅行優惠券提供各種折扣和優惠，包括景點門票、餐廳、住宿和交通。您可以在各種旅遊網站、應用程式或商家獲取。這些優惠券讓您在探索台灣的同時，享受更優惠的價格和更多活動選擇，為您的旅行增添更多樂趣。', 'drinkdadf33r39', '2023-05-19 02:28:28', '2023-05-19'),
(30, '吉祥新年賀卡', '18.00', '恭喜發財的賀卡，慶祝雞年，金雞獨立！', '禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i30.png', '恭喜發財的賀卡，慶祝雞年，金雞獨立！給你提供各種超值的折扣和優惠，包括景點門票、美味餐廳、舒適住宿和便捷交通。不管你在哪裡，都能在旅遊網站。', 'drinkdadf18', '2023-05-19 02:28:28', '2023-05-19'),
(31, '郵票-文青彩色', '20.00', '旅行中可以使用寄信給朋友', '周邊 旅行', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i31.png', '旅行中可以使用寄信給朋友。這些在地旅行優惠券真是超猛，就像一把魔法棒，能給你超多折扣和優惠！這些神奇的東西能讓你享受景點門票、美味大餐、豪華住宿和順暢交通的特權。你只需挖挖鼻孔，就能在旅遊網站、APP或商家裡找到。這些優惠券就像是你的旅行小助手，能讓你玩得更盡興、花得更聰明，絕對是旅行的最佳搭檔！', 'drinkdadf33r28', '2023-05-19 02:28:28', '2023-05-19'),
(32, '月老紅線', '20.00', '增加姻緣！來自超靈驗月老廟', '禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i32.png', '增加姻緣！來自超靈驗月老廟。都能在旅遊網站、APP或附近的商家拿到。這些優惠券不僅讓你玩得盡興，還能省錢，為你的旅行增添更多樂趣！', 'drinkdadf33r38', '2023-05-19 02:28:28', '2023-05-19'),
(33, '笑臉紀念鈕扣', '5.00', '可愛幽默風趣的小物', '周邊 禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i33.png', '可愛幽默風趣的小物。你只需挖挖鼻孔，就能在旅遊網站、APP或商家裡找到。這些優惠券就像是你的旅行小助手，能讓你玩得更盡興、花得更聰明，絕對是旅行的最佳搭檔！', '7drinkdadf17', '2023-05-19 02:28:28', '2023-05-19'),
(34, '紀念可愛童趣貼紙', '8.00', '充滿童趣的貼紙，可以貼在行李箱上', '周邊', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i34.png', '充滿童趣的貼紙，可以貼在行李箱上。這些優惠券不僅讓你玩得盡興，還能省錢，為你的旅行增添更多樂趣！', 'drinkdadf33r27', '2023-05-19 02:28:28', '2023-05-19'),
(35, '可愛眼睛風格標章', '12.00', '超可愛的大眼睛，精緻的產品，隨時別上超好看', '周邊 禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i35.png', '超可愛的大眼睛，精緻的產品，隨時別上超好看。不管你在哪裡，都能在旅遊網站、APP或附近的商家拿到。這些優惠券不僅讓你玩得盡興，還能省錢，為你的旅行增添更多樂趣！', 'drinkdadf33r37', '2023-05-19 02:28:28', '2023-05-19'),
(36, 'You are lover 徽章', '13.00', '送給愛人的旅行徽章，有紀念性質', '周邊 禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i36.png', '送給愛人的旅行徽章，有紀念性質。從神奇景點門票到仙境般的餐廳，還有如夢住宿。讓這些優惠券成為您旅行中的魔法法寶，帶您進入夢幻的冒險之旅。', 'drinkdadf16', '2023-05-19 02:28:28', '2023-05-19'),
(37, '笑臉托特包徽章', '12.00', '可以別在自己的包包上，好看', '周邊 禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i37.png', '可以別在自己的包包上，好看。為您的旅程注入能量和生機。在大自然的懷抱中，優惠券成為您探索台灣美麗風景的最佳伴侶。', 'drinkdadf33r26', '2023-05-19 02:28:28', '2023-05-19'),
(38, '小怪獸便條紙', '11.00', '很可愛的貼貼，可以在旅行看書時做筆記', '周邊 禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i38.png', '很可愛的貼貼，可以在旅行看書時做筆記。這些經典的優惠券就像是您的忠實伴侶，隨時準備為您服務。它們不僅能夠為您提供景點門票、美味餐飲，還有舒適住宿的機會，讓您的旅程變得更為完美。經典不朽，優惠券成為您旅行中的經典之選。', 'drinkdadf33r36', '2023-05-19 02:28:28', '2023-05-19'),
(39, '旅行用刷子', '120.00', '可以清除旅行時身上的灰塵', '旅行 禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i39.png', '可以清除旅行時身上的灰塵。如同大自然的恩賜，給您提供了多樣的選擇。從景點門票到餐廳、住宿，甚至交通，它們如同大自然的元素，為您的旅程注入能量和生機。', 'drinkdadf15', '2023-05-19 02:28:28', '2023-05-19'),
(40, '旅行用木質牙刷', '135.00', '可以隨時高質感時尚的刷牙齒，保持牙齒美白，有木頭香味', '周邊 旅行 禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i40.png', '可以隨時高質感時尚的刷牙齒，保持牙齒美白，有木頭香味。迎接夢幻的台灣在地旅行，優美的優惠券彷彿是童話故事的鑰匙，將敞開奇幻的大門。這些神奇的券讓你可以穿越各種場景，從神奇景點門票到仙境般的餐廳，還有如夢住宿。讓這些優惠券成為您旅行中的魔法法寶，帶您進入夢幻的冒險之旅。', 'drinkdadf33r25', '2023-05-19 02:28:28', '2023-05-19'),
(41, '友誼之傘', '278.00', '透明萊爾富70公分傘', '禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i41.png', '透明萊爾富70公分傘。如同大自然的恩賜，給您提供了多樣的選擇。從景點門票到餐廳、住宿，甚至交通，它們如同大自然的元素，為您的旅程注入能量和生機。在大自然的懷抱中，優惠券成為您探索台灣美麗風景的最佳伴侶。', 'drinkdadf33r35', '2023-05-19 02:28:28', '2023-05-19'),
(42, '健康補給飲料155', '20.00', '旅行中補充體力', '票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i42.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf155', '2023-05-19 02:28:28', '2023-05-19'),
(43, '健康補給飲料255', '20.00', '旅行中補充體力', '周邊', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i43.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r255', '2023-05-19 02:28:28', '2023-05-19'),
(44, '健康補給飲料355', '20.00', '旅行中補充體力', '周邊', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i44.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r355', '2023-05-19 02:28:28', '2023-05-19'),
(45, '健康補給飲料199', '20.00', '旅行中補充體力', '票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i45.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', '999', '2023-05-19 02:28:28', '2023-05-19'),
(46, '健康補給飲料299', '20.00', '旅行中補充體力', '禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i46.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r299', '2023-05-19 02:28:28', '2023-05-19'),
(47, '健康補給飲料399', '20.00', '旅行中補充體力', '票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i47.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r399', '2023-05-19 02:28:28', '2023-05-19'),
(48, '健康補給飲料188', '20.00', '旅行中補充體力', '周邊', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i48.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf188', '2023-05-19 02:28:28', '2023-05-19'),
(49, '健康補給飲料288', '20.00', '旅行中補充體力', '周邊', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i49.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r288', '2023-05-19 02:28:28', '2023-05-19'),
(50, '健康補給飲料388', '20.00', '旅行中補充體力', '禮品', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i50.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r388', '2023-05-19 02:28:28', '2023-05-19'),
(51, '健康補給飲料177', '20.00', '旅行中補充體力', '票券', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i51.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf177', '2023-05-19 02:28:28', '2023-05-19'),
(52, '健康補給飲料277', '20.00', '旅行中補充體力', '周邊', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i52.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r277', '2023-05-19 02:28:28', '2023-05-19'),
(53, '健康補給飲料377', '20.00', '旅行中補充體力', '周邊', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i53.png', '超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的超好喝的', 'drinkdadf33r377', '2023-05-19 02:28:28', '2023-05-19'),
(54, '冒險之旅鑰匙扣', '200.00', '跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙跟旅伴發動剛偷來機車的神奇鑰匙', '周邊 旅行 禮品', 3, '2023-05-18 18:04:00', '2023-05-27 02:06:00', 'p-i54.png', '金央詞目澡黃像汁用幸冬加兆元久占丟「種」未雨飯幫示快和大母？歡停泉具房爪，收升了足回方沒婆鼻現！三不我乞後法這買雲很結正杯象。\r\n\r\n司福乾掃孝邊豆幼勿喝訴飽以語邊首候竹壯。抓裝讀八。手來弟亭種要教話爪實草音兄自由向。喝止陽士氣助故着叫主午升蛋唱占神？兆動因枝胡經常從還穿車因現意停哪次。言肖媽從戊壯不到。苦肉王急足哥更刀口九乙毛。', 'GCriJDJIa', '2023-05-19 10:13:58', '2023-05-19'),
(55, '彩色紀念可愛貼紙', '120.00', '充滿童趣的貼紙，可以貼在行李箱上', '周邊', 4, '2023-05-18 18:27:00', '2023-05-27 02:28:00', 'p-i34.png', '充滿童趣的貼紙，可以貼在行李箱上。這些優惠券不僅讓你玩得盡興，還能省錢，為你的旅行增添更多樂趣！', 'drinkdadf33r27', '2023-05-19 02:28:28', '2023-05-19');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`product_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
