-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： localhost:8889
-- 產生時間： 2023 年 08 月 14 日 22:38
-- 伺服器版本： 5.7.39
-- PHP 版本： 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `fridntrip_final`
--

-- --------------------------------------------------------

--
-- 資料表結構 `itinerary`
--

CREATE TABLE `itinerary` (
  `itin_id` int(50) NOT NULL,
  `itin_member_id` int(11) DEFAULT NULL,
  `coverPhoto` varchar(100) DEFAULT NULL,
  `name` varchar(50) NOT NULL,
  `date` date DEFAULT NULL,
  `description` text,
  `public` varchar(20) DEFAULT NULL,
  `ppl` int(11) DEFAULT NULL,
  `note` text,
  `time` time DEFAULT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `itinerary`
--

INSERT INTO `itinerary` (`itin_id`, `itin_member_id`, `coverPhoto`, `name`, `date`, `description`, `public`, `ppl`, `note`, `time`, `create_at`) VALUES
(82, 2, '1920x1080_attractions-image-fwfaxumoiegq42wwkiwkpg.jpg', '台北: 猴硐貓村＆九份美食探索與品茶一日遊', '2023-07-30', '猴銅貓村曾獲CNN推薦為全球六大賞貓景點\r\n深入九份小徑與探索美食小吃\r\n品嚐台灣在地茶葉，遼望海景\r\n進入金礦博物館，了解煤礦歷史與對在地的文化影響', '公開', 6, '* 行程可能視交通與天候狀況調整\r\n*此活動最少需6人成團，如未達最低成團人數，將為你安排改期\r\n*行程包含大量步行及階梯攀爬，請確保有足夠體力參加。', '08:00:00', '2023-07-27 16:03:46'),
(86, 2, '20190126200544-f4cbc46b.jpg', '新北:平溪十分天燈半日遊', '2023-07-31', '台北一日遊推薦！半日體驗平溪當地天燈文化，了解台灣文化遺產\r\n走訪與火車鐵軌並存相連的十分老街，也是許多電影的取景勝地\r\n前往十分車站尋找通往幸福的郵筒\r\n闖入宛如人間仙境的十分瀑布，有台灣的尼加拉瓜瀑布之稱', '公開', 5, '*此活動最少需5人成團，如未達最低成團人數，將為你安排改期\n*若因天氣影響無法出行，將於活動日前一天透過email或手機通知\n*請提前5分鐘抵達集合地點', '09:30:00', '2023-07-27 16:10:20'),
(87, 2, 'pic.jpeg', '基隆＆新北:野柳郊外半日遊', '2023-08-01', '幸運的話可以在龜吼漁港看見萬里蟹\r\n深度基隆及野柳欣賞令人嘖嘖稱奇的東北角海岸線景色\r\n看見野柳由大自然鬼斧神工的雕刻塑造出獨一無二的岩石', '公開', 3, '*此活動最少需3人成團，如未達最低成團人數，將為你安排改期\n*若因天氣影響無法出行，將於活動日前一天透過email或手機通知\n*請提前5分鐘抵達集合地點', '09:00:00', '2023-07-27 16:13:31'),
(88, 2, 'zozivvvwi82szk9cfnkc.jpg', '台北茶文化一日遊:在地茶園茶席體驗・貓空纜車', '2023-08-07', '一次走訪台北近郊三大茶區，沉浸在茶香繚繞的美好時光\r\n搭乘貓空纜車,感受居高臨下俯視台灣山景的壯麗\r\n享受自然風光，感受千島湖靜謐的氛圍，彷彿被自然擁抱', '公開', 5, '*此活動最少需5人成團，如未達最低成團人數，將為你安排改期\r\n*若因天氣影響無法出行，將於活動日前一天透過email或手機通知\r\n*請提前5分鐘抵達集合地點', '08:00:00', '2023-07-27 16:16:43'),
(89, 2, 'shutterstock_1377979610.jpg', '台北象山探索一日遊', '2023-07-28', '在像山近距離觀看台北101大樓以及眺望寬敞的城市風景', '公開', 3, '*此活動最少需3人成團，如未達最低成團人數，將為你安排改期\r\n*若因天氣影響無法出行，將於活動日前一天透過email或手機通知\r\n*請提前5分鐘抵達集合地點', '09:00:00', '2023-07-27 16:21:49'),
(90, 2, '20200928130639_13.jpg', '平溪線三貂嶺碩仁秘境小鎮一日遊', '2023-08-07', '沿著基隆河谷來趟三貂嶺碩仁一日遊小旅行，走訪猴硐國小猴子溜滑梯、礦工紀念館、猴硐礦工文史館、猴硐壺穴，前往秘境小鎮碩仁聚落品嘗阿珠姐肉羹、文瓊小築草仔粿，步行前往三貂嶺車站、碩仁國小，最後再以Cafe Hytte的咖啡香當作結尾，來場猴硐、三貂嶺之旅', '不公開', 4, '*請提前5分鐘抵達集合地點\r\n*快快樂樂渡過一天吧～', '09:30:00', '2023-07-27 16:26:50'),
(93, 2, '東北角一日遊.jpg', '東北角必去IG打卡景點一日遊', '2023-07-29', '漫步在台灣東北角，遠眺海景、近觀海岸海蝕地形\r\n最療癒的觀海步道，讓人最嚮往的忘憂地點\r\n200年歷史漁港，化身為台版威尼斯彩色島\r\n不能錯過的北台灣基隆廟口在地美食', '不公開', 3, '一起當美美網美一天吧～～', '09:30:00', '2023-07-28 21:30:36'),
(96, 2, '1024x768_attractions-image-c1cb45bt3eom6wfbjxxxqa.jpg', '淡水一日遊', '2023-07-31', '淡水騎踏車，吃吃喝喝，下午一起看夕陽', '不公開', 3, '快快樂樂渡過一天吧！', '10:00:00', '2023-07-31 11:45:19'),
(97, 1, '1920x1080_attractions-image-2not98phfuerj636ka-ywq.jpg', '基隆八斗子景點一日遊', '2023-08-20', '滿分的順遊地圖，走遊八斗子景點\r\n順遊美景，輕鬆規畫一日遊，就能玩的很精彩\r\n還能收錄滿滿美圖，歡樂度過每一個假期唷～', '公開', 6, '帶著快樂的心情出門吧～', '08:00:00', '2023-07-31 20:13:21'),
(102, 2, '1630645163-1886000378-g_wn.jpg', '和平島', '2023-08-01', '和平島', '不公開', 2, '快快樂樂渡過一天吧！', '09:30:00', '2023-08-01 21:24:27'),
(104, 5, 'tour007001.jpg', '猴銅貓村', '2023-08-20', '猴銅貓村', '公開', 2, '帶著快樂的心情出門吧～', '09:30:00', '2023-08-01 21:44:03'),
(105, 2, '221908.jpeg', '台北植物園', '2023-08-06', '台北植物園', '不公開', 3, '快快樂樂渡過一天吧！', '09:30:00', '2023-08-01 22:04:46'),
(112, 25, '1024x768_attractions-image-b7fnf-nawewxv2l-mejppq.jpg', '陽明山一日遊', '2023-08-04', '陽明山一日遊', '不公開', 3, '帶著快樂的心情出門吧～', '09:30:00', '2023-08-04 16:32:09'),
(123, 22, '1024x768_attractions-image-4jc9kqhpl0ctleja2d546g.jpg', '烏來老街', '2023-08-22', '帶著快樂的心情出門吧～', '公開', 3, '帶著快樂的心情出門吧～', '09:00:00', '2023-08-05 13:10:59'),
(124, 2, 'jolley-hotel-apartment-hotel-thumbnail-190318a_1.jpg', '台北- 夜迷之行：鼎泰豐晚餐＆饒河夜市', '2023-08-06', '到訪曾為世界第一高樓的台北101。\r\n享用「米其林指南必比登推薦」鼎泰豐小籠包。\r\n探索台灣街頭美食好去處 ─ 饒河街觀光夜市。', '公開', 3, '* 菜單可能隨季節與食材供應調整\r\n* 行程可能視交通與天候狀況調整\r\n* 若因天氣因素無法成行，將於活動日前一天透過email或手機告知\r\n* 請提前5分鐘抵達集合地點', NULL, '2023-08-06 00:38:26'),
(132, 14, 'article-625cd41d8fb38.jpg', '三貂嶺-腳踏車漫遊', '2023-08-19', '快節奏的台北 總是無形中帶給我們壓力\r\n看了想去的旅遊地點 卻遲遲沒有行動\r\n決定放慢角度 細細品味台灣的美景\r\n這是我愛自己 愛台灣的方式♥️', '公開', 4, '集合地點：台北車站\r\n行程時間：含搭車 總共約8小時\r\n人數：4人以內（能夠互相分享交流的人數）', '08:00:00', '2023-08-06 12:23:46'),
(134, 2, '84e13aaab557cb3532b0763a2e5aaf8f.jpeg', '花博公園', '2023-08-07', '享受不一樣的台北風情～', '不公開', 3, '快快樂樂渡過一天吧！', '16:07:00', '2023-08-06 14:07:19'),
(136, 2, 'pic_2129_3.jpg', '台北: 淡水國家級古蹟 & 北投溫泉一日遊', '2023-08-11', '台灣最早開發的北部區域，一覽國家級歷史古蹟\r\n瞭望淡水河口與海的界線，台北市最美觀海地點\r\n熱門淡水老街，品嚐在地美食\r\n日據時代最著名的溫泉開發區\r\n終年瀰漫著硫磺煙霧的地熱谷，是北投溫泉的源頭', '公開', 6, '*此活動最少需6人成團，如未達最低成團人數，將為你安排改期', '09:20:00', '2023-08-07 18:21:42'),
(137, 2, '1024x768_attractions-image-hy7x3b6nq0sullro7o4gkq.jpg', '軍艦岩親山步道', '2023-08-09', 'IG打卡景點 ! 遠眺臺北盆地 !', '公開', 3, '搭乘捷運至石牌站至一號出口出站後，可步行至陽明大學登山口，步行約20分鐘', '09:48:00', '2023-08-08 09:49:51'),
(138, 2, '5072_1.jpg', '圖坦卡門：出土百年紀念特展', '2023-08-10', '一起來去看埃及木乃伊吧！！', '公開', 4, '*找尋對埃及有興趣的朋友', '10:52:00', '2023-08-08 09:53:04'),
(139, 2, '1920x1080_attractions-image-ednhaec4nekngjgcawb2gw.jpg', '三峽老街一日遊', '2023-08-21', '三峽私房景點，一起走入懷舊時光', '公開', 3, '*請提早10分鐘集合', '09:30:00', '2023-08-08 10:01:33'),
(140, 2, '1920x1080_20130829162820.jpg', '三峽老街一日遊｜山林秘境探險路線', '2023-08-09', '喜歡漫步在樹木間的朋友們，一邊散步一邊享受微風和大自然的芬多精，獲得身心靈的解放', '公開', 4, '*喜歡山林秘境的朋友們還不趕快放入避暑名單', '08:05:00', '2023-08-08 10:06:33'),
(141, 2, '9177F0FB-3240-437C-A0B9-BCE10B469212_e.jpg', '礁溪一日遊', '2023-08-20', '欣賞宜蘭的最美夜景', '公開', 4, '*如遇天候不佳或不可抗力情況，可能取消行程或安排改期', '10:00:00', '2023-08-08 10:13:09'),
(142, 2, '628_news_banner.jpg', '三峽老街吃吃喝喝', '2023-08-11', '三峽老街吃吃喝喝', '公開', 6, '*身為吃貨的你，不要錯過這次行程\r\n*一起記錄美食地圖吧', '10:17:00', '2023-08-08 10:19:22'),
(144, 23, 'mainhomeBanner1.jpg', '朱銘美術館&美食一日遊', '2023-08-20', '朱銘美術館位於新北金山區，寬敞的館區擺放著朱銘不同時期的作品，讓人沉浸在藝術的薰陶之中。\r\n走在美術館就像在大型公園裡散步。', '公開', 5, '*朱銘美術館位於新北金山區，寬敞的館區擺放著朱銘不同時期的作品，讓人沉浸在藝術的薰陶之中。', '09:30:00', '2023-08-08 10:26:42'),
(145, 2, '1920x1080_20130829162820.jpg', '台北一日遊', '2023-08-08', '第一次來台北玩，好期待', '不公開', 3, '第一次來台北玩，好期待', '04:04:00', '2023-08-08 14:03:16'),
(148, 21, '1024x768_attractions-image-y8ggbhpeduqjcztypawkha.jpg', '金瓜石一日遊', '2023-08-21', '難得的休假日，來個金瓜石一日遊小旅行吧！', '公開', 4, '難得的休假日，來個金瓜石一日遊小旅行吧！', '10:00:00', '2023-08-08 14:41:52'),
(149, 19, 'Fulong-International-Sand-Sculpture-Art-Season-2023-8.jpg', '福隆沙雕季一日遊', '2023-08-23', '今年以”經典迪士尼百年慶典”為主題\r\n將近60座的迪士尼黃金沙雕主題作品\r\n主雕是超級夢幻的20公尺高的迪士尼城堡呀\r\n再搭配新北福隆貢寮一日遊絕對精彩充實!', '公開', 3, '*今年以”經典迪士尼百年慶典”為主題', '10:10:00', '2023-08-08 15:08:53'),
(150, 32, '1574055895-2804131009_n.jpg', '坪林景點一日遊', '2023-08-25', '坪林擁有得天獨厚的地形優勢，水資源也很豐富\r\n走訪坪林，就是來到茶的故鄉，處處是茶田美景\r\n來賞茶園，少不了要品嚐茶香，吃美味茶點料理', '公開', 5, '*走訪坪林，就是來到茶的故鄉，處處是茶田美景', '10:15:00', '2023-08-08 15:14:52'),
(152, 15, '16844760763712942540.jpg', '大稻埕夏日煙火', '2023-08-20', '每年固定於七夕情人節舉辦的大稻埕情人節煙火秀，一直以來都會吸引不少觀光客前往觀賞，也是除台北101跨年煙火之外，在台北夏日舉行的大型煙火表演。', '公開', 5, '*晚餐-寧夏夜市\r\n*大稻埕逛市集', '17:35:00', '2023-08-09 10:46:16'),
(153, 4, '221739.jpeg', '故宮一日遊', '2023-08-27', '來一場士林藝文知性之旅吧～', '公開', 3, '*來一場士林藝文知性之旅吧～', '09:30:00', '2023-08-09 10:56:42'),
(154, 3, '13_18060412160413437.jpg', '總統府＆華山文創一日遊', '2023-08-20', '懷舊與潮流的風雲際會，走進生活裡的傳統建築', '公開', 4, '*此活動最少需4人成團，如未達最低成團人數，將為你安排改期', '10:52:00', '2023-08-09 11:54:35'),
(155, 16, 'pic_73_2.jpg', '松山文創＆中正紀念堂一日遊', '2023-08-20', '一日小旅行起點從這邊開始~', '公開', 3, '*一日小旅行起點從這邊開始~', '13:00:00', '2023-08-09 12:01:03'),
(156, 7, '20200611151632_82.jpg', '石碇＆深坑一日遊（新北景點）', '2023-08-21', '許多人來深坑，只在老街吃美食實在有點可惜，老街上其實有一些拍照景點，而且附近也有古蹟可以走走參觀。\r\n更有多條步道，滿足你走向大自然的心願。', '公開', 5, '*深坑老街吃吃喝喝', '10:00:00', '2023-08-09 12:05:14'),
(157, 8, '淡水關稅務司官邸.jpg', '淡水一日遊', '2023-08-23', '淡水有豐富的文化古蹟、熱鬧的淡水老街、也有浪漫的景觀餐廳、新開的影城，很久沒有走訪淡水，覺得淡水真的耳目一新，\r\n以下一日遊景點推薦給大家。', '公開', 6, '*希望大家有不一樣淡水回憶', '22:00:00', '2023-08-09 12:10:24'),
(158, 12, '20180730161033-da3e5253.jpg', '碧潭＆烏來一日遊', '2023-08-21', '踏青之外還能泡溫泉呢～～', '公開', 3, '*一起去郊外踏青吧！\r\n*如遇到天氣因素可能會取消或改期唷～', '10:00:00', '2023-08-09 13:32:50'),
(159, 9, '6BAE69E4-3197-47E1-8FE4-7B7A39874159_e.jpg', '木柵動物園半日遊', '2023-08-22', '木柵動物園，超值得一訪再訪，又萌又可愛的動物們趕緊來看看', '公開', 4, '*木柵動物園，超值得一訪再訪，又萌又可愛的動物們趕緊來看看', '13:30:00', '2023-08-09 13:35:43'),
(160, 10, 'std_9880acbdb3d8430cabbc1fcd48430128.jpg', '台灣第一學府知性一日遊', '2023-08-17', '走入歷史懷舊時光', '公開', 4, '*體驗不同的歷史文情', '21:40:00', '2023-08-09 13:38:24'),
(161, 11, 'IMG_2083-850x478.jpg', '古蹟＆潮流衝突一日遊', '2023-08-21', '體驗古蹟＆潮流衝突一日遊', '公開', 5, '*剝皮寮，百年前清朝街道風貌，過去因為電影《艋舺》而爆紅。\r\n紅磚牆、拱型騎樓、雕花窗櫺是最大參觀重點，順便品嘗龍山寺美食超好玩', '14:30:00', '2023-08-09 13:44:31'),
(162, 17, 'pic.jpeg', '基隆海線一日遊', '2023-08-20', '放空看海踩鐵道自行車', '公開', 5, '*騎腳踏車一路上欣賞海景', '09:30:00', '2023-08-09 13:56:05'),
(163, 28, 'A20220112134401723.jpg', '基隆文青一日遊', '2023-08-18', '帶大家造訪基隆地標夜景等特色景點，讓你看見基隆最美的風景', '公開', 4, '*遠離市區，看看夜景', '22:30:00', '2023-08-09 14:26:05'),
(164, 2, '1024x768_attractions-image-ft7cy8frh0kfaqpkaszotw.jpg', '陽明山半日遊', '2023-08-13', '擎天岡看牛牛～', '不公開', 2, '擎天岡看牛牛～', '09:30:00', '2023-08-09 14:48:38'),
(166, 2, '四四南村.jpeg', '台北101、四四南村一日遊', '2023-08-23', '大都會下的眷村風情，美食、遊憩、拍照好去處', '公開', 4, '*大都會下的眷村風情，美食、遊憩、拍照好去處', '10:10:00', '2023-08-10 09:10:13'),
(167, 2, 'yingof_0027.jpg', '鶯歌、三峽一日遊', '2023-08-25', '鶯歌、三峽吃吃喝喝', '公開', 3, '*一起做屬於自己陶做', '09:30:00', '2023-08-10 09:27:59'),
(168, 2, '西門町.jpg', '華山、中正紀念堂、西門町一日遊', '2023-08-10', '西門町吃吃喝喝', '不公開', 2, '*西門町吃吃喝喝', '02:40:00', '2023-08-10 09:37:30'),
(169, 2, 'pic (1).jpeg', '兒童新樂園 ', '2023-08-20', '回憶當兒童感覺', '不公開', 4, '回憶當兒童感覺', '10:42:00', '2023-08-10 09:42:13'),
(170, 2, '1mj4t12000aq3a4dq3153_C_800_600_R5.jpg_.webp', '陽明山兜風', '2023-08-18', '補足假期空閒時間，讓生活更加充實與美好\r\n', '不公開', 3, '*補足假期空閒時間，讓生活更加充實與美好', '09:30:00', '2023-08-10 09:52:58'),
(171, 20, '20220817113417-33988cde.jpg', '八里半日遊', '2023-08-12', '期待在八里吃美食，必吃雙胞胎！', '不公開', 2, '*騎摩托車去，長褲方便活動', '15:00:00', '2023-08-10 09:55:47'),
(172, 6, '1920x1080_2defafe0-ff2e-4857-8197-906c64e32646.jpg', '石碇老街一日遊', '2023-08-22', '石碇老街美食必吃清單', '公開', 4, '*找尋一起喜歡吃美食的朋友', '10:30:00', '2023-08-10 10:15:16'),
(173, 2, '大安森林公園.jpeg', '大安森林公園', '2023-08-19', '忙碌之餘，假日也需要讓自己身心靈放鬆', '公開', 3, '*一起去野餐', '10:30:00', '2023-08-10 10:29:24'),
(174, 26, '1597912616-3290908353-g.jpg', '烏來一日遊', '2023-08-20', '烏來老街、烏來商圈位於泰雅族部落之內，是一個泰雅族文化特色相當濃厚的觀光地區。烏來Ulay 在泰雅語的意思是「冒著蒸氣的湧泉」，代表著烏來產溫泉為名，另外山櫻花、烏來瀑布也是烏來特色', '公開', 3, '*IG打卡熱點', '10:30:00', '2023-08-10 10:36:30'),
(178, 38, '2023051815563847.png', '大稻埕煙火閉幕', '2023-08-20', '今年夏日煙火最後一場8分鐘的煙火，絕對不可以錯過', '公開', 6, '*祝有情人沒情人都快樂', '19:40:00', '2023-08-10 15:15:20'),
(179, 18, '蘭陽博物館-1.jpg', '宜蘭必去景點', '2023-08-19', '絕對不可錯過的景點', '公開', 4, '*宜蘭必去景點', '21:30:00', '2023-08-10 22:04:30'),
(180, 11, '1612703513-2394501810-g.png', '宜蘭熱門景點一日遊', '2023-08-19', '推薦網美景點', '公開', 3, '*必去的熱門景點', '21:35:00', '2023-08-10 22:23:27'),
(181, 13, '1mj4t12000aq3a4dq3153_C_800_600_R5.jpg_.webp', '投入大自然懷抱', '2023-08-19', '呼吸新鮮空氣', '不公開', 3, '*多多接觸大自然', '12:30:00', '2023-08-10 22:40:57');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `itinerary`
--
ALTER TABLE `itinerary`
  ADD PRIMARY KEY (`itin_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `itinerary`
--
ALTER TABLE `itinerary`
  MODIFY `itin_id` int(50) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=191;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
