-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： localhost:8889
-- 產生時間： 2023 年 08 月 14 日 01:43
-- 伺服器版本： 5.7.39
-- PHP 版本： 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `fridntrip_final`
--

-- --------------------------------------------------------

--
-- 資料表結構 `product_comment`
--

CREATE TABLE `product_comment` (
  `comment_id` int(255) NOT NULL,
  `member_id` int(255) NOT NULL,
  `product_id` int(255) NOT NULL,
  `order_id` varchar(255) NOT NULL,
  `comment_content` varchar(255) NOT NULL,
  `comment_rating` int(11) NOT NULL,
  `comment_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `product_comment`
--

INSERT INTO `product_comment` (`comment_id`, `member_id`, `product_id`, `order_id`, `comment_content`, `comment_rating`, `comment_time`) VALUES
(1, 1, 7, 'p205rhll9lau15', '飯店衛生不佳！其他旅伴也有同感，不推', 2, '2023-08-13 23:22:10'),
(2, 1, 17, 'p205rhll9lau15', '價格實惠，也耐用', 4, '2023-08-13 23:22:10'),
(3, 1, 32, 'p205rhll9lau15', '超推！和旅伴一起出去玩沒過多久就在一起了', 5, '2023-08-13 23:22:10'),
(4, 1, 1, 'p205rhll9lau15', '質感不錯！帶出去玩旅伴也說很喜歡', 4, '2023-08-13 23:22:10'),
(5, 1, 3, 'p205rhll9lau15', '很好，我喜歡這顏色，手機變好看了', 5, '2023-08-13 23:22:10'),
(6, 1, 6, 'p205rhll9lau15', '送給旅伴，他很開心', 5, '2023-08-13 23:22:10'),
(7, 1, 5, 'p205rhll9lau15', '這是交友網站吧，賣這個是不是有點斂財？', 2, '2023-08-13 23:22:10'),
(8, 1, 8, 'p205rhll9lau15', '很有質感，帶出去玩很有時尚感', 4, '2023-08-13 23:22:10'),
(9, 1, 10, 'p205rhll9lau15', '能裝的水量不多，帶出去玩很容易就喝完口渴', 3, '2023-08-13 23:22:10'),
(10, 1, 18, 'p205rhll9lau15', '包裝好禮物，實用', 5, '2023-08-13 23:22:10'),
(11, 1, 34, 'p205rhll9lau15', '別在外出包包上，可愛', 4, '2023-08-13 23:22:10'),
(12, 1, 33, 'p205rhll9lau15', '別在外出包包上，非常可愛', 5, '2023-08-13 23:22:10'),
(13, 1, 39, '3dlg3tll9lilo4', '難用！', 1, '2023-08-13 23:24:56'),
(14, 1, 42, '3dlg3tll9lilo4', '不好用', 2, '2023-08-13 23:24:56'),
(15, 1, 145, 'mp8cdoll9llila', '快中暑了，熊貓也看不到幾眼，不推！', 2, '2023-08-13 23:26:56'),
(16, 3, 1, 'h7v4fcll9lopqz', '很有質感的小物，大推！', 5, '2023-08-13 23:30:44'),
(17, 3, 2, 'h7v4fcll9lopqz', '我很喜歡！增加居家風格！', 5, '2023-08-13 23:30:44'),
(18, 3, 4, 'h7v4fcll9lopqz', '頁面有點少有點可惜，但我還是喜歡', 4, '2023-08-13 23:30:44'),
(19, 3, 9, 'h7v4fcll9lopqz', '沒什麼防水，但容量真的大', 2, '2023-08-13 23:30:44'),
(20, 3, 13, 'h7v4fcll9lopqz', '太厚，濕熱的環境不適合穿，但材質不錯', 3, '2023-08-13 23:30:44'),
(21, 3, 12, 'h7v4fcll9lopqz', '可以放很多小工具', 4, '2023-08-13 23:30:44'),
(22, 3, 16, 'h7v4fcll9lopqz', '有質感的包裝', 4, '2023-08-13 23:30:44'),
(23, 3, 49, 'b09cxvll9ltnvx', '很棒！', 4, '2023-08-13 23:33:13'),
(24, 3, 52, 'b09cxvll9ltnvx', '有質感的好物', 4, '2023-08-13 23:33:13'),
(25, 3, 51, 'b09cxvll9ltnvx', '這是什麼？不好用', 1, '2023-08-13 23:33:13'),
(26, 3, 70, 'b09cxvll9ltnvx', '會卡灰塵', 2, '2023-08-13 23:33:13'),
(27, 3, 63, 'b09cxvll9ltnvx', '超好聽！超期待！', 4, '2023-08-13 23:33:13'),
(28, 4, 1, 'mze2jell9lwuc5', '包裝破損！', 2, '2023-08-13 23:37:36'),
(29, 4, 2, 'mze2jell9lwuc5', '搭配悠閒午後的咖啡很讚', 5, '2023-08-13 23:37:36'),
(30, 4, 3, 'mze2jell9lwuc5', '旅伴看到都很喜歡', 5, '2023-08-13 23:37:36'),
(31, 4, 6, 'mze2jell9lwuc5', '參加這裡的活動很多人都會戴', 4, '2023-08-13 23:37:36'),
(32, 4, 9, 'mze2jell9lwuc5', '耐髒抗污！', 4, '2023-08-13 23:37:36'),
(33, 4, 7, 'mze2jell9lwuc5', '有夠爛！服務品質極差！不推', 1, '2023-08-13 23:37:36'),
(34, 4, 25, 'mze2jell9lwuc5', '規則沒說清楚', 3, '2023-08-13 23:37:36'),
(35, 4, 23, 'mze2jell9lwuc5', '有換到免費餐飲，開心', 4, '2023-08-13 23:37:36'),
(36, 4, 62, 'mze2jell9lwuc5', '整體來說非常棒！', 4, '2023-08-13 23:37:36'),
(37, 4, 59, 'mze2jell9lwuc5', '很有質感的外出醫藥盒', 4, '2023-08-13 23:37:36'),
(38, 4, 58, 'mze2jell9lwuc5', '可以放很多外帶食物', 4, '2023-08-13 23:37:36'),
(39, 4, 56, 'mze2jell9lwuc5', '很好看，很閃亮，旅伴也很喜歡', 4, '2023-08-13 23:37:36'),
(40, 4, 118, 'cj45y6ll9m2em8', '有夠好玩的！激推', 5, '2023-08-13 23:39:47'),
(41, 4, 123, 'cj45y6ll9m2em8', '好看又好吃', 4, '2023-08-13 23:39:47'),
(42, 4, 120, 'cj45y6ll9m2em8', '很多玩具可以選擇', 4, '2023-08-13 23:39:47'),
(43, 5, 1, 'nmjvc9ll9m6u5v', '送旅伴但他不收！', 1, '2023-08-13 23:47:59'),
(44, 5, 5, 'nmjvc9ll9m6u5v', '用起來很順手，拍了很多出去玩美好的回憶', 4, '2023-08-13 23:47:59'),
(45, 5, 4, 'nmjvc9ll9m6u5v', '一般的筆記本，但好看', 4, '2023-08-13 23:47:59'),
(46, 5, 8, 'nmjvc9ll9m6u5v', '我喜歡他的觸感，拿起來喝水很潮', 4, '2023-08-13 23:47:59'),
(47, 5, 7, 'nmjvc9ll9m6u5v', '大家不要被騙了！這家水準有夠低', 1, '2023-08-13 23:47:59'),
(48, 5, 13, 'nmjvc9ll9m6u5v', '登山穿還行，很舒服', 4, '2023-08-13 23:47:59'),
(49, 5, 11, 'nmjvc9ll9m6u5v', '出去玩帶著很方便', 4, '2023-08-13 23:47:59'),
(50, 5, 33, 'nmjvc9ll9m6u5v', '很喜歡這種小東西', 4, '2023-08-13 23:47:59'),
(51, 5, 10, 'nmjvc9ll9m6u5v', '寄來就破掉了...', 1, '2023-08-13 23:47:59'),
(52, 5, 123, 'nmjvc9ll9m6u5v', '還不錯吃，但份量少一些', 4, '2023-08-13 23:47:59'),
(53, 5, 59, 'nmjvc9ll9m6u5v', '真的好好看，很多東西都有', 4, '2023-08-13 23:47:59'),
(54, 5, 121, 'nmjvc9ll9m6u5v', '選擇的電影激推，很適合和旅伴來看電影', 5, '2023-08-13 23:47:59'),
(55, 5, 122, 'nmjvc9ll9m6u5v', '夏日解渴', 5, '2023-08-13 23:47:59'),
(56, 5, 86, 'nmjvc9ll9m6u5v', '很好玩！很多機台，旅伴也很喜歡', 5, '2023-08-13 23:47:59'),
(57, 5, 83, 'nmjvc9ll9m6u5v', '可以攜帶很多小物品出門，方便！', 5, '2023-08-13 23:47:59'),
(58, 5, 84, 'nmjvc9ll9m6u5v', '虐待表演動物....旅伴看到哭', 1, '2023-08-13 23:47:59'),
(59, 5, 90, 'nmjvc9ll9m6u5v', '長得有點微妙', 2, '2023-08-13 23:47:59'),
(60, 5, 74, 'zbpr4ella5ra7t', '還不錯！', 4, '2023-08-14 08:50:41'),
(61, 6, 1, '5vuyshlla5t9q6', '品質不錯！帶去旅行很棒', 4, '2023-08-14 08:55:46'),
(62, 6, 2, '5vuyshlla5t9q6', '放上馬克杯很有質感', 4, '2023-08-14 08:55:46'),
(63, 6, 3, '5vuyshlla5t9q6', '粉紅少女心！', 4, '2023-08-14 08:55:46'),
(64, 6, 8, '5vuyshlla5t9q6', '很棒的水瓶！', 5, '2023-08-14 08:55:46'),
(65, 6, 37, '5vuyshlla5t9q6', '品質好！好可愛呀', 4, '2023-08-14 08:55:46'),
(66, 6, 38, '5vuyshlla5t9q6', '好可愛，可以貼在旅行筆記上', 5, '2023-08-14 08:55:46'),
(67, 6, 40, '5vuyshlla5t9q6', '好用品質佳，可以在飯店刷牙', 5, '2023-08-14 08:55:46'),
(68, 6, 45, '5vuyshlla5t9q6', '天然好材料', 5, '2023-08-14 08:55:46'),
(69, 6, 123, '303jytlla62m0f', '好吃！', 5, '2023-08-14 09:00:23'),
(70, 6, 54, '303jytlla62m0f', '還不錯用，讓我的餐具很乾淨', 4, '2023-08-14 09:00:23'),
(71, 6, 39, '303jytlla62m0f', '一直掉毛！', 1, '2023-08-14 09:00:23'),
(72, 6, 55, '303jytlla62m0f', '顏值高但功能普通', 3, '2023-08-14 09:00:23'),
(73, 7, 2, 'uom9fklla6880c', '好有質感！', 5, '2023-08-14 09:07:22'),
(74, 7, 32, 'uom9fklla6880c', '沒求到姻緣！大家都不愛我QQ', 2, '2023-08-14 09:07:22'),
(75, 7, 38, 'uom9fklla6880c', '份量太少了吧！雖然很可愛', 2, '2023-08-14 09:07:22'),
(76, 7, 40, 'uom9fklla6880c', '難刷，CP值不高', 3, '2023-08-14 09:07:22'),
(77, 7, 45, 'uom9fklla6880c', '有化學的怪味，品質不佳', 3, '2023-08-14 09:07:22'),
(78, 7, 12, 'uom9fklla6880c', '品質高，裝很多文具', 5, '2023-08-14 09:07:22'),
(79, 7, 18, 'uom9fklla6880c', '線不太好', 2, '2023-08-14 09:07:22'),
(80, 7, 121, 'uom9fklla6880c', '電影不錯看，但冷氣不夠強', 4, '2023-08-14 09:07:22'),
(81, 7, 4, 'uom9fklla6880c', '品質佳，好看', 4, '2023-08-14 09:07:22'),
(82, 7, 48, 'uom9fklla6880c', '太少了吧！不好看', 2, '2023-08-14 09:07:22'),
(83, 7, 53, 'uom9fklla6880c', '實品與照片不符，但還是好用', 3, '2023-08-14 09:07:22'),
(84, 7, 106, 'uom9fklla6880c', '好看！', 4, '2023-08-14 09:07:22'),
(85, 7, 110, 'uom9fklla6880c', '好看！', 4, '2023-08-14 09:07:22'),
(86, 7, 108, 'uom9fklla6880c', '好看！', 4, '2023-08-14 09:07:22'),
(87, 7, 104, 'uom9fklla6880c', '好用！', 4, '2023-08-14 09:07:22'),
(88, 7, 11, 'vk8hi6lla6grs3', '耳機不錯！', 4, '2023-08-14 09:10:31'),
(89, 8, 6, 'i9gvdxlla6k80w', '好漂亮！好喜歡！帶出去玩很好看', 5, '2023-08-14 09:15:28'),
(90, 8, 1, 'i9gvdxlla6k80w', '少女心噴發！！', 5, '2023-08-14 09:15:28'),
(91, 8, 8, 'i9gvdxlla6k80w', '出去玩可以帶！好有時尚感', 5, '2023-08-14 09:15:28'),
(92, 8, 23, 'i9gvdxlla6k80w', 'ROCK!!!!!!!!!', 5, '2023-08-14 09:15:28'),
(93, 8, 27, 'i9gvdxlla6k80w', 'ROCK!!!!!!!!!', 5, '2023-08-14 09:15:28'),
(94, 8, 26, 'i9gvdxlla6k80w', '沒有安排好！但很好玩', 3, '2023-08-14 09:15:28'),
(95, 8, 25, 'i9gvdxlla6k80w', '折扣沒想像中多，但換了很多出去玩的用品', 4, '2023-08-14 09:15:28'),
(96, 8, 29, 'i9gvdxlla6k80w', '在外可以寄給朋友來紀念旅遊', 5, '2023-08-14 09:15:28'),
(97, 8, 31, 'i9gvdxlla6k80w', '在外可以寄給朋友來紀念旅遊', 5, '2023-08-14 09:15:28'),
(98, 8, 30, 'i9gvdxlla6k80w', '雞年過了......', 2, '2023-08-14 09:15:28'),
(99, 8, 34, 'i9gvdxlla6k80w', '泡水很容易爛掉，但很可愛', 4, '2023-08-14 09:15:28'),
(100, 8, 35, 'lhyviylla6pe11', '可愛', 4, '2023-08-14 09:17:44'),
(101, 8, 124, 'lhyviylla6pe11', '好喝好喝', 5, '2023-08-14 09:17:44'),
(102, 8, 73, 'lhyviylla6pe11', '買了很多東西！', 1, '2023-08-14 09:17:44'),
(103, 8, 72, 'lhyviylla6pe11', 'ROCK!!!!!', 3, '2023-08-14 09:17:44'),
(104, 9, 27, 'xuqh8qlla6t1fh', '動線爛！', 2, '2023-08-14 09:22:05'),
(105, 9, 31, 'xuqh8qlla6t1fh', '太貴了吧！', 2, '2023-08-14 09:22:05'),
(106, 9, 124, 'xuqh8qlla6t1fh', '好喝！品質佳', 5, '2023-08-14 09:22:05'),
(107, 9, 122, 'xuqh8qlla6t1fh', '爛！但好喝', 3, '2023-08-14 09:22:05'),
(108, 9, 13, 'xuqh8qlla6t1fh', '穿一穿就破，但好看', 3, '2023-08-14 09:22:05'),
(109, 9, 25, 'xuqh8qlla6t1fh', '折扣沒很多', 3, '2023-08-14 09:22:05'),
(110, 9, 35, 'xuqh8qlla6t1fh', '可愛！激推！旅伴都說讚', 5, '2023-08-14 09:22:05'),
(111, 9, 45, 'xuqh8qlla6t1fh', '普普.....', 2, '2023-08-14 09:22:05'),
(112, 9, 56, 'xuqh8qlla6t1fh', '不錯！出去玩順便送禮物可以用', 4, '2023-08-14 09:22:05'),
(113, 9, 108, 'xuqh8qlla6t1fh', '乳牛.....', 2, '2023-08-14 09:22:05'),
(114, 9, 57, 'xuqh8qlla6t1fh', '野餐好用！，裝了鬆餅', 5, '2023-08-14 09:22:05'),
(115, 9, 10, 'xuqh8qlla6t1fh', '出去玩不用再怕口渴了', 5, '2023-08-14 09:22:05'),
(116, 9, 43, 'xuqh8qlla6t1fh', '品質沒很好，寧可去小北買', 2, '2023-08-14 09:22:05'),
(117, 9, 47, 'xuqh8qlla6t1fh', '超高級！比LV出的還好看', 5, '2023-08-14 09:22:05'),
(118, 10, 89, 'ntiv0nlla6ygzg', '還好...', 3, '2023-08-14 09:25:47'),
(119, 10, 88, 'ntiv0nlla6ygzg', '超好玩！粉紅泡泡滿地都是', 5, '2023-08-14 09:25:47'),
(120, 10, 68, 'ntiv0nlla6ygzg', '音質超好！顏色很好看', 5, '2023-08-14 09:25:47'),
(121, 10, 72, 'ntiv0nlla6ygzg', '搖來搖去隨著音樂搖擺', 4, '2023-08-14 09:25:47'),
(122, 10, 67, 'ntiv0nlla6ygzg', '音質普普，但還可以', 4, '2023-08-14 09:25:47'),
(123, 10, 46, 'ntiv0nlla6ygzg', '好潮好好看的顏色', 5, '2023-08-14 09:25:47'),
(124, 10, 47, 'ntiv0nlla6ygzg', '很好看，品質很棒', 4, '2023-08-14 09:25:47'),
(125, 10, 31, 'ntiv0nlla6ygzg', '普普....', 3, '2023-08-14 09:25:47'),
(126, 10, 9, 'ntiv0nlla6ygzg', '容量大好攜帶出門！', 5, '2023-08-14 09:25:47'),
(127, 10, 1, 'ntiv0nlla6ygzg', '我很愛帶他出門冒險旅行', 5, '2023-08-14 09:25:47'),
(128, 11, 1, 'dbkmeslla789bg', '好可愛！！帶他去旅行很棒！！', 4, '2023-08-14 09:35:22'),
(129, 11, 3, 'dbkmeslla789bg', '好可愛！！帶他去旅行很棒！！', 4, '2023-08-14 09:35:22'),
(130, 11, 2, 'dbkmeslla789bg', '裝咖啡就更好喝了', 4, '2023-08-14 09:35:22'),
(131, 11, 4, 'dbkmeslla789bg', '普普', 3, '2023-08-14 09:35:22'),
(132, 11, 6, 'dbkmeslla789bg', '還不錯！帶出去玩好看', 4, '2023-08-14 09:35:22'),
(133, 11, 5, 'dbkmeslla789bg', '搶錢...', 3, '2023-08-14 09:35:22'),
(134, 11, 9, 'dbkmeslla789bg', '超好看大包包！', 4, '2023-08-14 09:35:22'),
(135, 11, 10, 'dbkmeslla789bg', '不錯的商品', 4, '2023-08-14 09:35:22'),
(136, 11, 17, 'dbkmeslla789bg', '爛...', 2, '2023-08-14 09:35:22'),
(137, 11, 18, 'dbkmeslla789bg', '難用', 2, '2023-08-14 09:35:22'),
(138, 11, 19, 'dbkmeslla789bg', '場地不好，但音樂不錯', 3, '2023-08-14 09:35:22'),
(139, 11, 20, 'dbkmeslla789bg', '颱風天套票不給退....', 1, '2023-08-14 09:35:22'),
(140, 11, 21, 'dbkmeslla789bg', '好喝！比買一送一划算，但沒差多少', 3, '2023-08-14 09:35:22'),
(141, 11, 26, 'dbkmeslla789bg', '好玩但好熱', 4, '2023-08-14 09:35:22'),
(142, 11, 35, 'dbkmeslla789bg', '可愛！我好喜歡！！！！', 5, '2023-08-14 09:35:22'),
(143, 11, 36, 'dbkmeslla789bg', '可愛！我好喜歡！！！！', 4, '2023-08-14 09:35:22'),
(144, 11, 40, 'dbkmeslla789bg', '還不錯用！在旅館可以用', 4, '2023-08-14 09:35:22'),
(145, 11, 146, 'dbkmeslla789bg', '猴子會朝遊客亂丟東西...', 3, '2023-08-14 09:35:22'),
(146, 11, 145, 'dbkmeslla789bg', '熊貓只知道睡覺....沒互動不好玩', 3, '2023-08-14 09:35:22'),
(147, 11, 144, 'dbkmeslla789bg', '好看！增加美術素養', 5, '2023-08-14 09:35:22'),
(148, 11, 142, 'dbkmeslla789bg', '好看！增加美術素養', 5, '2023-08-14 09:35:22'),
(149, 11, 139, 'dbkmeslla789bg', '好吃！', 4, '2023-08-14 09:35:22'),
(150, 2, 62, '93ycx8lla7g4hg', '我愛浮淺！謝謝FriendTrip提供這麼優惠的套票', 4, '2023-08-14 09:38:57'),
(151, 2, 65, '93ycx8lla7g4hg', '品質不佳！一下就斷線', 1, '2023-08-14 09:38:57'),
(152, 2, 77, '93ycx8lla7g4hg', '好可愛！', 4, '2023-08-14 09:38:57'),
(153, 2, 80, '93ycx8lla7g4hg', '好可愛！', 4, '2023-08-14 09:38:57'),
(154, 2, 34, '9y8mpvlla7jhdq', '好可愛的貼紙！', 4, '2023-08-14 09:41:36'),
(155, 2, 59, '9y8mpvlla7jhdq', '出去玩可以用，很有質感', 4, '2023-08-14 09:41:36'),
(156, 2, 61, '9y8mpvlla7jhdq', '不推的課程...和旅伴的體驗都不佳', 2, '2023-08-14 09:41:36');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `product_comment`
--
ALTER TABLE `product_comment`
  ADD PRIMARY KEY (`comment_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_comment`
--
ALTER TABLE `product_comment`
  MODIFY `comment_id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=157;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
