-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 11, 2023 at 01:48 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `fridntrip_final`
--

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `comment_id` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL,
  `content` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `comments`
--

INSERT INTO `comments` (`comment_id`, `member_id`, `post_id`, `content`, `created_at`) VALUES
(2, 3, 6, '先把自己照顧好\r\n有好的身心狀態更有機會遇到和自己頻率相近的人', '2023-07-27 20:11:30'),
(3, 2, 5, '每天還是要視訊聊一下才對啊！', '2023-07-26 20:37:52'),
(4, 5, 3, '謝謝分享', '2023-07-27 21:07:25'),
(5, 1, 7, '希望女兒遇到好人!', '2023-07-27 21:08:41'),
(6, 3, 8, '看對眼就好，青菜蘿蔔各有所好', '2023-07-26 21:09:44'),
(7, 1, 12, '同意，兩個人比較好吧！', '2023-07-27 21:28:12'),
(8, 2, 13, '不會啦！有明確目標去了就回來也沒有關係啊！', '2023-07-26 21:31:16'),
(10, 4, 76, '下次記得約我哦！', '2023-08-05 01:06:02'),
(12, 99, 108, '這不就是派拉蒙電影公司開場的山嗎？', '2023-08-08 05:02:42'),
(13, 77, 109, '算我一份，下個月去嗎？', '2023-08-08 06:53:12'),
(14, 21, 109, '我考慮看看', '2023-08-08 17:58:33'),
(15, 37, 111, '我有興趣一起去，我之前在宜蘭泛舟過，很刺激!', '2023-08-08 19:26:47'),
(16, 37, 112, '天哪！上禮拜才一起去泛舟，現在又想要攀岩，好，再跟你去一次。', '2023-08-08 19:53:48'),
(24, 6, 109, '不要考慮太久，名額有限！', '2023-08-08 22:29:27'),
(25, 25, 113, '同意，這個我可以給你們一起去，算我一份', '2023-08-08 22:50:21'),
(26, 25, 114, '想認識的私信我', '2023-08-08 22:55:44'),
(27, 20, 114, '發你私訊了，麻煩你了郁晴，謝謝', '2023-08-08 22:59:03'),
(28, 25, 111, '還有我，我是房郁晴', '2023-08-09 21:31:54'),
(29, 7, 111, '等等我，兩位帥哥，我也去', '2023-08-09 22:04:41'),
(30, 7, 115, '划完船，就吃pizza，那之前的運動都白費了', '2023-08-09 22:07:07'),
(31, 7, 115, '還是吃素食吧', '2023-08-09 22:08:42'),
(33, 7, 117, '如何？還不錯吧', '2023-08-10 01:52:59'),
(34, 7, 117, '說說看', '2023-08-10 01:53:30'),
(35, 53, 122, '我29，無不良嗜好，喜歡旅遊、爬山，可以私訊你嗎？', '2023-08-10 06:32:36'),
(36, 53, 122, '我是真心的！', '2023-08-10 07:07:26'),
(53, 7, 124, '是不是在台南，還是嘉義', '2023-08-10 18:30:01'),
(56, 5, 128, '我喜歡鐵人三項', '2023-08-10 19:28:54'),
(57, 5, 124, '好像是嘉義，高跟鞋教堂', '2023-08-10 19:29:35'),
(64, 19, 150, '這是我表哥', '2023-08-10 21:38:54'),
(65, 19, 150, '在加拿大拍的', '2023-08-10 21:39:21'),
(67, 19, 152, '怎麼樣？有人有興趣下次一起去嗎？', '2023-08-10 21:44:13'),
(68, 19, 150, '不錯吧！', '2023-08-10 21:48:51'),
(69, 19, 150, '怎麼樣啊？', '2023-08-10 21:49:16'),
(70, 19, 150, '你說說看嘛', '2023-08-10 21:49:35'),
(71, 4, 150, 'cool', '2023-08-10 22:11:43'),
(72, 4, 140, 'hey', '2023-08-10 22:11:56'),
(73, 4, 153, 'seee', '2023-08-10 22:13:21'),
(74, 3, 155, 'I love Napoli Pizza', '2023-08-10 22:26:55'),
(75, 3, 159, '誰要一起來', '2023-08-10 22:29:03'),
(76, 3, 159, '私信我', '2023-08-10 22:29:29'),
(77, 3, 160, '讓你們流口水', '2023-08-10 22:32:10'),
(78, 3, 161, '是要跟我一起，私訊', '2023-08-10 22:48:40'),
(79, 3, 161, '已婚者勿擾', '2023-08-10 22:49:24'),
(80, 3, 164, '要的私聊（限未婚）', '2023-08-10 23:08:58'),
(81, 3, 164, '最好5男5女，湊一桌', '2023-08-10 23:10:16'),
(82, 3, 164, '各付各的', '2023-08-10 23:10:53'),
(83, 3, 164, '每人 $450', '2023-08-10 23:11:38'),
(84, 3, 155, '我喜歡必勝客', '2023-08-10 23:19:32'),
(85, 3, 150, '結婚了嗎，沒有的話可以介紹一下嗎', '2023-08-10 23:22:24'),
(86, 3, 140, '台南，哦不對，在嘉義', '2023-08-10 23:22:49');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`comment_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `comment_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=87;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
