-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 14, 2023 at 02:14 PM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `fridntrip_final`
--

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `comment_id` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL,
  `content` text NOT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `comments`
--

INSERT INTO `comments` (`comment_id`, `member_id`, `post_id`, `content`, `created_at`) VALUES
(2, 3, 6, '先把自己照顧好\r\n有好的身心狀態更有機會遇到和自己頻率相近的人', '2023-07-27 12:11:30'),
(3, 2, 5, '每天還是要視訊聊一下才對啊！', '2023-07-26 12:37:52'),
(4, 5, 3, '謝謝分享', '2023-07-27 13:07:25'),
(5, 1, 7, '希望女兒遇到好人!', '2023-07-27 13:08:41'),
(6, 3, 8, '看對眼就好，青菜蘿蔔各有所好', '2023-07-26 13:09:44'),
(7, 1, 12, '同意，兩個人比較好吧！', '2023-07-27 13:28:12'),
(8, 2, 13, '不會啦！有明確目標去了就回來也沒有關係啊！', '2023-07-26 13:31:16'),
(10, 4, 76, '下次記得約我哦！', '2023-08-04 17:06:02'),
(12, 99, 108, '這不就是派拉蒙電影公司開場的山嗎？', '2023-08-07 21:02:42'),
(13, 77, 109, '算我一份，下個月去嗎？', '2023-08-07 22:53:12'),
(14, 21, 109, '我考慮看看', '2023-08-08 09:58:33'),
(15, 37, 111, '我有興趣一起去，我之前在宜蘭泛舟過，很刺激!', '2023-08-08 11:26:47'),
(16, 37, 112, '天哪！上禮拜才一起去泛舟，現在又想要攀岩，好，再跟你去一次。', '2023-08-08 11:53:48'),
(24, 6, 109, '不要考慮太久，名額有限！', '2023-08-08 14:29:27'),
(25, 25, 113, '同意，這個我可以給你們一起去，算我一份', '2023-08-08 14:50:21'),
(26, 25, 114, '想認識的私信我', '2023-08-08 14:55:44'),
(27, 20, 114, '發你私訊了，麻煩你了郁晴，謝謝', '2023-08-08 14:59:03'),
(28, 25, 111, '還有我，我是房郁晴', '2023-08-09 13:31:54'),
(29, 7, 111, '等等我，兩位帥哥，我也去', '2023-08-09 14:04:41'),
(30, 7, 115, '划完船，就吃pizza，那之前的運動都白費了', '2023-08-09 14:07:07'),
(31, 7, 115, '還是吃素食吧', '2023-08-09 14:08:42'),
(33, 7, 117, '如何？還不錯吧', '2023-08-09 17:52:59'),
(34, 7, 117, '說說看', '2023-08-09 17:53:30'),
(35, 53, 122, '我29，無不良嗜好，喜歡旅遊、爬山，可以私訊你嗎？', '2023-08-09 22:32:36'),
(36, 53, 122, '我是真心的！', '2023-08-09 23:07:26'),
(53, 7, 124, '是不是在台南，還是嘉義', '2023-08-10 10:30:01'),
(56, 5, 128, '我喜歡鐵人三項', '2023-08-10 11:28:54'),
(57, 5, 124, '好像是嘉義，高跟鞋教堂', '2023-08-10 11:29:35'),
(64, 19, 150, '這是我表哥', '2023-08-10 13:38:54'),
(65, 19, 150, '在加拿大拍的', '2023-08-10 13:39:21'),
(67, 19, 152, '怎麼樣？有人有興趣下次一起去嗎？', '2023-08-10 13:44:13'),
(68, 19, 150, '不錯吧！', '2023-08-10 13:48:51'),
(69, 19, 150, '怎麼樣啊？', '2023-08-10 13:49:16'),
(70, 19, 150, '你說說看嘛', '2023-08-10 13:49:35'),
(74, 3, 155, 'I love Napoli Pizza', '2023-08-10 14:26:55'),
(75, 3, 159, '誰要一起來', '2023-08-10 14:29:03'),
(76, 3, 159, '私信我', '2023-08-10 14:29:29'),
(77, 3, 160, '讓你們流口水', '2023-08-10 14:32:10'),
(78, 3, 161, '是要跟我一起，私訊', '2023-08-10 14:48:40'),
(79, 3, 161, '已婚者勿擾', '2023-08-10 14:49:24'),
(80, 3, 164, '要的私聊（限未婚）', '2023-08-10 15:08:58'),
(81, 3, 164, '最好5男5女，湊一桌', '2023-08-10 15:10:16'),
(82, 3, 164, '各付各的', '2023-08-10 15:10:53'),
(83, 3, 164, '每人 $450', '2023-08-10 15:11:38'),
(84, 3, 155, '我喜歡必勝客', '2023-08-10 15:19:32'),
(85, 3, 150, '結婚了嗎，沒有的話可以介紹一下嗎', '2023-08-10 15:22:24'),
(86, 3, 140, '台南，哦不對，在嘉義', '2023-08-10 15:22:49'),
(91, 11, 164, '我加入', '2023-08-10 17:13:48'),
(92, 11, 167, '預計下個月出發', '2023-08-10 17:17:21'),
(93, 11, 167, '有興趣的人請私訊我，謝謝', '2023-08-10 17:17:43'),
(94, 18, 164, '+1', '2023-08-10 18:04:54'),
(95, 18, 3, '不要在熱門時段出遊，11月份不錯', '2023-08-10 18:06:04'),
(96, 18, 172, '希望希望', '2023-08-10 18:16:55'),
(97, 18, 173, '禱告', '2023-08-10 18:17:49'),
(98, 24, 180, 'jjj', '2023-08-10 20:28:47'),
(99, 2, 185, 'eat', '2023-08-10 04:57:01'),
(100, 2, 185, 'like it', '2023-08-10 04:57:16'),
(101, 2, 186, 'aaaaaaaaaaaaa', '2023-08-10 05:01:58'),
(102, 2, 186, 'ppppppppppp', '2023-08-10 05:02:07'),
(103, 8, 188, '照片裡的人是我', '2023-08-11 10:26:42'),
(104, 8, 190, 'test test', '2023-08-11 10:32:29'),
(105, 8, 190, 'test test', '2023-08-11 10:32:48'),
(106, 8, 190, 'ok', '2023-08-11 10:33:02'),
(107, 8, 190, 'again', '2023-08-11 10:35:16'),
(108, 8, 190, 'jesus help', '2023-08-11 10:35:55'),
(109, 8, 190, 'maria help', '2023-08-11 10:36:10'),
(110, 8, 190, 'God is great', '2023-08-11 10:36:40'),
(111, 8, 190, 'God cover everything', '2023-08-11 10:37:00'),
(112, 14, 191, 'chair', '2023-08-11 10:40:06'),
(113, 14, 191, 'i like white chaor', '2023-08-11 10:40:30'),
(114, 14, 191, 'i dont like standing', '2023-08-11 10:40:44'),
(115, 14, 192, 'that\'s me', '2023-08-11 10:41:50'),
(116, 14, 192, 'me me', '2023-08-11 10:41:59'),
(117, 14, 192, 'me me me', '2023-08-11 10:42:09'),
(118, 14, 193, 'kkk', '2023-08-11 10:43:21'),
(119, 14, 189, '我小時候跟爸爸去過', '2023-08-11 10:45:30'),
(120, 14, 195, '照片裡的人是我表妹', '2023-08-11 10:50:00'),
(121, 28, 195, '這裡應該是石牌吧', '2023-08-11 11:06:08'),
(122, 28, 199, '希望可以在這裡找到喜歡夜遊的朋友一起去', '2023-08-11 11:10:28'),
(123, 28, 201, '念念不忘啊！希望妳可以幫我忘了她', '2023-08-11 11:18:12'),
(124, 35, 201, '我也是，下次見面一起聊聊', '2023-08-11 11:20:54'),
(125, 35, 200, '夜景很美，現在看觸景生情啊！', '2023-08-11 11:22:59'),
(126, 35, 203, '誰想來？', '2023-08-11 11:25:53'),
(127, 17, 204, 'beatiful', '2023-08-11 16:56:55'),
(128, 17, 205, 'good fit', '2023-08-11 16:58:18'),
(129, 17, 205, 'really good', '2023-08-11 16:59:07'),
(130, 17, 205, 'very good', '2023-08-11 16:59:22'),
(132, 14, 195, 'good', '2023-08-11 17:01:26'),
(136, 8, 188, 'That\'s me', '2023-08-11 19:03:18'),
(137, 8, 206, 'Who wants to eat with me?', '2023-08-11 19:05:37'),
(138, 8, 206, 'Anyone ?', '2023-08-11 19:05:46'),
(139, 8, 200, 'I can feel it.', '2023-08-11 19:07:54'),
(140, 8, 209, 'I\'m loving it!', '2023-08-11 20:31:38'),
(141, 3, 205, 'very handsome!', '2023-08-12 09:39:52'),
(144, 20, 212, 'That\'s me everybody.', '2023-08-12 11:27:38'),
(145, 20, 205, 'I like this type of guy', '2023-08-12 11:33:17'),
(146, 20, 204, 'I want to join. Count me in!', '2023-08-12 11:33:47'),
(147, 20, 203, '我想來', '2023-08-12 11:34:30'),
(148, 20, 216, 'That\'s my grandpa', '2023-08-13 13:08:11'),
(149, 20, 217, 'That\'s my grandpa', '2023-08-13 13:22:24'),
(150, 20, 219, '他是我爺爺，在阿爾卑斯山', '2023-08-13 14:31:00'),
(151, 20, 122, '考慮', '2023-08-13 16:46:20'),
(152, 20, 122, '我會考慮', '2023-08-13 16:47:11'),
(153, 20, 117, '真的很好，我也想來一口', '2023-08-13 16:47:36'),
(154, 2, 219, '老當益壯，爺爺好厲害啊！', '2023-08-14 10:33:43'),
(155, 3, 204, 'beautiful', '2023-08-14 15:52:30'),
(156, 3, 222, 'very good', '2023-08-14 15:53:28'),
(157, 3, 223, '希望能碰到金城武！', '2023-08-14 19:47:42'),
(158, 3, 225, '希望能碰到金城武！', '2023-08-14 19:52:42'),
(159, 3, 227, '我要去，已經私訊你了', '2023-08-14 20:03:34'),
(160, 5, 227, '我也去，算我一個', '2023-08-14 20:05:25'),
(161, 5, 227, '問一下，這是哪裡？', '2023-08-14 20:06:00');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`comment_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `comment_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=162;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
